#define DL_ASSTEXT 16
#define DL_OBJTEXT 50                             /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ . я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥   */
#define NSYM 10                                   /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒    */
#define NPOP 6                                    /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─. */
#define NOP  6                                    /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√    */
#include <string.h>                               /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─. */
#include <stdlib.h>                               /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ */
#include <stdio.h>                                /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓.п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▒/п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▒  */
#include <ctype.h>                                /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. */

/*
******* п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓
*/

char NFIL [30] = "\x0";

unsigned char PRNMET = 'N';                       /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙⌠.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ */
int I3;                                           /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥           */

/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥ 1-п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥
*/

						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FDC();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DC    */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FDS();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DS    */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FEND();                                       /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.END   */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FEQU();                                       /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.EQU   */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FSTART();                                     /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.START */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FUSING();                                     /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.USING */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FRR();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RR-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int FRX();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RX-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
/*..........................................................................*/

/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥ 2-п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥
*/

						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SDC();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DC    */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SDS();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DS    */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SEND();                                       /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.END   */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SEQU();                                       /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.EQU   */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SSTART();                                     /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.START */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SUSING();                                     /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.USING */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SRR();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RR-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
/*..........................................................................*/
						  /*п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈*/
int SRX();                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RX-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
/*..........................................................................*/

/*
******* п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥
*/

/*
******* п©б╘п╠Б∙╔п©б╘п▒Б┬ Б√⌠'п©б╘п▒Б┬≥б╥п©б╘п▒Б┬ Б▄═п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙║п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б■╛Б┴╔ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ (п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─) п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥
*/

 struct ASSKARTA                                  /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓ */
  {
   unsigned  char METKA    [ 8];                  /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙              */
   unsigned  char PROBEL1  [ 1];                  /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤-я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■      */
   unsigned  char OPERAC   [ 5];                  /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙           */
   unsigned  char PROBEL2  [ 1];                  /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤-я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■      */
   unsigned  char OPERAND  [12];                  /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥           */
   unsigned  char PROBEL3  [ 1];                  /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■      */
   unsigned  char COMM     [52];                  /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒        */
  };

/*
******* п©б╘п╠Б∙║п©б╘п▒Б┬ Б√▓п©б╘п▒Б√└Б∙▒п©б╘п╠Б∙╔п©б╘п▒Б■╛б═п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙║п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б■╛Б┴╔ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓. я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─
*/

 union                                            /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
  {
   unsigned char BUFCARD [80];                    /*п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─.п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥  */
   struct ASSKARTA STRUCT_BUFCARD;                /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ */
  } TEK_ISX_KARTA;

/*
***** п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б┬ п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√⌠п©б╘п▒Б┬≥Б┬ п©б╘п▒Б■╢Б∙⌠п©б╘п╠Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥ц╥ (я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─ )
*/

 int CHADR;                                       /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈                 */

/*
***** п©б╘п▒Б┬≥Б√⌠п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б┬≥Б┬≥п©б╘п▒Б┬ Б√▓ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒
*/

 int ITSYM = -1;                                  /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─. я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒.*/
 struct TSYM                                      /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒.*/
  {
   unsigned char IMSYM [8];                       /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥             */
   int           ZNSYM;                           /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥        */
   int           DLSYM;                           /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥           */
   char          PRPER;                           /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒     */
  };

 struct TSYM T_SYM [NSYM];                        /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒.  */

/*
***** п©б╘п▒Б┬≥Б√⌠п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б┬≥Б┬≥п©б╘п▒Б┬ Б√▓ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√
*/

 struct TMOP                                      /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
  {
   unsigned char MNCOP [5];                       /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙       */
   unsigned char CODOP    ;                       /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙   */
   unsigned char DLOP     ;                       /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б┴╓ */
   int (*BXPROG)()        ;                       /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░*/
  } T_MOP [NOP]  =                                /*п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
    {
     {{'B','A','L','R',' '} , '\x05' , 2 , FRR} , /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒           */
     {{'B','C','R',' ',' '} , '\x07' , 2 , FRR} , /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈                   */
     {{'S','T',' ',' ',' '} , '\x50' , 4 , FRX} , /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟я▐Б√░п▒Б┬ Б■─                 */
     {{'L',' ',' ',' ',' '} , '\x58' , 4 , FRX} , /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓                */
     {{'A',' ',' ',' ',' '} , '\x5A' , 4 , FRX} , /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√                */
     {{'S',' ',' ',' ',' '} , '\x5B' , 4 , FRX} , /*                        */
    };

/*
***** п©б╘п▒Б┬≥Б√⌠п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б┬≥Б┬≥п©б╘п▒Б┬ Б√▓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√
*/

 struct TPOP                                      /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤eя▐Б√░п▒Б√═Б■─.*/
  {
   unsigned char MNCPOP[5];                       /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ */
   int (*BXPROG) ()       ;                       /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░*/
  } T_POP [NPOP] =                                /*п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤*/
    {
     {{'D','C',' ',' ',' '} , FDC   },            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒           */
     {{'D','S',' ',' ',' '} , FDS   },            /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈                   */
     {{'E','N','D',' ',' '} , FEND  },            /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟я▐Б√░п▒Б┬ Б■─                 */
     {{'E','Q','U',' ',' '} , FEQU  },            /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√          */
     {{'S','T','A','R','T'} , FSTART},            /*                        */
     {{'U','S','I','N','G'} , FUSING}             /*                        */
    };

/*
***** п©б╘п▒Б┬≥Б√⌠п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╢Б∙⌠п©б╘п▒Б┬≥Б┬≥п©б╘п▒Б┬ Б√▓ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒
*/

 struct TBASR                                     /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■.я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌.*/
  {
   int SMESH;                                     /*                        */
   char PRDOST;                                   /*                        */
  } T_BASR[15] =                                  /*                        */
    {
     {0x00,'N'},                                  /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒           */
     {0x00,'N'},                                  /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈                   */
     {0x00,'N'},                                  /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟я▐Б√░п▒Б┬ Б■─                 */
     {0x00,'N'},                                  /*п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓                 */
     {0x00,'N'},                                  /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒               */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'},                                  /*                        */
     {0x00,'N'}                                   /*                        */
    };

/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░   п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥
*/

  unsigned char OBJTEXT [DL_OBJTEXT][80];         /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└   */
  int ITCARD = 0;                                 /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒.п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─   */

  struct OPRR                                     /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥.RR */
   {
    unsigned char OP;                             /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙            */
    unsigned char R1R2;                           /*R1 - п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓     */
						  /*R2 - п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓     */
   };

  union                                           /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
   {
    unsigned char BUF_OP_RR [2];                  /*п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─         */
    struct OPRR OP_RR;                            /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡     */
   } RR;

  struct OPRX                                     /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥.RX */
   {
    unsigned char OP;                             /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙            */
    unsigned char R1X2;                           /*R1 - п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓     */
    short B2D2;                                     /*X2 - п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓     */
//    int B2D2;                                     /*X2 - п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓     */
						  /*B2 - п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■.я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌.2-п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤-п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ */
						  /*D2 - я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─*/
   };

  union                                           /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
   {
    unsigned char BUF_OP_RX [4];                  /*п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─         */
    struct OPRX OP_RX;                            /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡     */
   } RX;

  struct STR_BUF_ESD                              /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ ESD */
   {
    unsigned char POLE1      ;                    /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ */
    unsigned char POLE3  [ 6];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char POLE31 [ 2];                    /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒   */
    unsigned char POLE32 [ 2];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char POLE4  [ 2];                    /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓-я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─. */
    unsigned char IMPR   [ 8];                    /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б√▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─           */
    unsigned char POLE6      ;                    /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ ESD-п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙      */
    unsigned char ADPRG  [ 3];                    /*п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─ */
    unsigned char POLE8      ;                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char DLPRG  [ 3];                    /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─         */
    unsigned char POLE10 [40];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char POLE11 [ 8];                    /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒  */
   };

 struct STR_BUF_TXT                               /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ TXT */
   {
    unsigned char POLE1      ;                    /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ */
    unsigned char POLE3      ;                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤                  */
    unsigned char ADOP   [ 3];                    /*п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙  */
    unsigned char POLE5  [ 2];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char DLNOP  [ 2];                    /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙          */
    unsigned char POLE7  [ 2];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char POLE71 [ 2];                    /*п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─. */
    unsigned char OPER   [56];                    /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙           */
    unsigned char POLE9  [ 8];                    /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒  */
   };

struct STR_BUF_END                                /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ END */
   {
    unsigned char POLE1      ;                    /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ 0x02     */
    unsigned char POLE2  [ 3];                    /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ */
    unsigned char POLE3  [68];                    /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■─                 */
    unsigned char POLE9  [ 8];                    /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒  */
   };

  union                                           /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
   {
    struct STR_BUF_ESD STR_ESD;                   /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥        */
    unsigned char BUF_ESD [80];                   /*п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ ESD         */
   } ESD;


  union                                           /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
   {
    struct STR_BUF_TXT STR_TXT;                   /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥        */
    unsigned char BUF_TXT [80];                   /*п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ TXT         */
   } TXT;

  union                                           /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
   {
    struct STR_BUF_END STR_END;                   /*я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥        */
    unsigned char BUF_END [80];                   /*п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ ESD         */
   } END;


/*
******* п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥, п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ 1-п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒
*/

int FDC()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DC    */
 {
  if ( PRNMET == 'Y' )                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤.DC п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠.,*/
   {                                              /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:                     */
    if                                            /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ DC */
     (                                            /* п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒   */
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F'/* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ F, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■   */
     )                                            /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:             */
     {
      T_SYM[ITSYM].DLSYM = 4;                     /*  я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. =  4, */
      T_SYM[ITSYM].PRPER = 'R';                   /*  п©б╘п▒Б┬≥ц╥,п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.='R' */
      if ( CHADR % 4 )                            /*  п©б╘п▒Б┬≥Б∙∙, п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■.*/
       {                                          /*  п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟я▐Б√░п▒Б√═Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
	CHADR = (CHADR /4 + 1) * 4;               /*   я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤. п©б╘п▒Б┬≥Б∙∙*/
	T_SYM[ITSYM].ZNSYM = CHADR;               /*   п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ . п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. */
       }
      PRNMET = 'N';                               /*  п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ PRNMET п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .'N'*/
     }
    else
     return (1);                                  /* п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒  */
   }
  else                                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌠п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤.п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠*/
   if ( CHADR % 4 )                               /*п©б╘п▒Б┬≥Б∙∙ CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙  4,я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
    CHADR = (CHADR /4 + 1) * 4;                   /* я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤.*/

  CHADR = CHADR + 4;                              /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ 4 п©б╘п▒Б┬≥Б∙∙     */
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.*/
 }
/*..........................................................................*/
int FDS()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DS    */
 {
  if ( PRNMET == 'Y' )                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤.DC п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠.,*/
   {                                              /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:                     */
    if                                            /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ DC */
     (                                            /* п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒   */
      TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F'/* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥ F, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■   */
     )                                            /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:             */
     {
      T_SYM[ITSYM].DLSYM = 4;                     /*  я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. =  4, */
      T_SYM[ITSYM].PRPER = 'R';                   /*  п©б╘п▒Б┬≥ц╥,п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.='R' */
      if ( CHADR % 4 )                            /*  п©б╘п▒Б┬≥Б∙∙, п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■.*/
       {                                          /*  п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟я▐Б√░п▒Б√═Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
	CHADR = (CHADR /4 + 1) * 4;               /*   я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤. п©б╘п▒Б┬≥Б∙∙*/
	T_SYM[ITSYM].ZNSYM = CHADR;               /*   п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ . п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. */
       }
      PRNMET = 'N';                               /*  п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ PRNMET п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .'N'*/
     }
    else
     return (1);                                  /* п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒  */
   }
  else                                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌠п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤.п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠*/
   if ( CHADR % 4 )                               /*п©б╘п▒Б┬≥Б∙∙ CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙  4,я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
    CHADR = (CHADR /4 + 1) * 4;                   /* я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤.*/

  CHADR = CHADR + 4;                              /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.CHADR п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ 4 п©б╘п▒Б┬≥Б∙∙     */
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.*/
 }
/*..........................................................................*/
int FEND()                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.END   */
 {
  return (100);                                   /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ я▐Б√░п▒Б√═Б■▄ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥ц╥ 1-п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡*/
						  /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥               */
 }
/*..........................................................................*/
int FEQU()                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.EQU   */
 {
  if                                              /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒         */
   (                                              /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ DC       */
    TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] =='*' /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙  я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒. '*',  */
   )                                              /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡                      */
    {                                             /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒.:*/
     T_SYM[ITSYM].ZNSYM = CHADR;                  /*  CHADR п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ ZNSYM,   */
     T_SYM[ITSYM].DLSYM = 1;                      /*  1 п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ DLSYM,       */
     T_SYM[ITSYM].PRPER = 'R';                    /*  'R' п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ PRPER     */
    }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒*/
    {                                             /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤-п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤. */
     T_SYM[ITSYM].ZNSYM = atoi (                  /* DC п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ ZNSYM,       */
      (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND
			       );
     T_SYM[ITSYM].DLSYM = 1;                      /* 1 п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ DLSYM,        */
     T_SYM[ITSYM].PRPER = 'A';                    /* 'A' п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ PRPER       */
    }
  PRNMET = 'N';                                   /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤.PRNMET п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .'N' */
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.  */
 }
/*..........................................................................*/
int FSTART()                                      /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.START */
 {                                                /*CHADR я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥ */
  CHADR =                                         /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥       */
       atoi(
       (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND/*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ START п©б╘п▒Б┬≥Б∙∙, */
	   );
  if ( CHADR % 8 )                                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒    */
   {                                              /*п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ 8, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡*/
    CHADR = ( CHADR + ( 8 - CHADR % 8 ) );        /*п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥                 */
   }                                              /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒.: */
  T_SYM[ITSYM].ZNSYM = CHADR;                     /* CHADR п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ ZNSYM,    */
  T_SYM[ITSYM].DLSYM = 1;                         /* 1 п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ DLSYM,        */
  T_SYM[ITSYM].PRPER = 'R';                       /* 'R' п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ PRPER       */
  PRNMET = 'N';                                   /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤.PRNMET п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .'N' */
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─*/
 }
/*..........................................................................*/
int FUSING()                                      /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.USING */
 {
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─*/
 }
/*..........................................................................*/
int FRR()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RR-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
 {
  CHADR = CHADR + 2;                              /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─. п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ 2  */
  if ( PRNMET == 'Y' )                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥, */
   {                                              /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒:    */
    T_SYM[ITSYM].DLSYM = 2;                       /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
    T_SYM[ITSYM].PRPER = 'R';                     /*п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥*/
   }
  return(0);                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─   */
 }
/*..........................................................................*/
int FRX()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RX-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
 {
  CHADR = CHADR + 4;                              /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─. п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ 4  */
  if ( PRNMET == 'Y' )                            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥, */
   {                                              /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒:    */
    T_SYM[ITSYM].DLSYM = 4;                       /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
    T_SYM[ITSYM].PRPER = 'R';                     /*п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥*/
   }
  return(0);                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─   */
 }
/*..........................................................................*/

/*
******* п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥, п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ 2-п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒
*/

void STXT( int ARG )                              /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─.TXT-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
 {
  char *PTR;                                      /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒-я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.*/

  PTR = (char *)&CHADR;                           /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ ADOP  */
  TXT.STR_TXT.ADOP[2]  = *PTR;                    /*TXT-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒     */
  TXT.STR_TXT.ADOP[1]  = *(PTR+1);                /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡        */
  TXT.STR_TXT.ADOP[0]  = '\x00';                  /*п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▓ п©б╘п▒Б┬≥б╟п©б╘п▒Б┬ Б▄═п©б╘п╠Б∙÷    */

  if ( ARG == 2 )                                 /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ OPER  */
   {
    memset ( TXT.STR_TXT.OPER , 64 , 4 );
    memcpy ( TXT.STR_TXT.OPER,RR.BUF_OP_RR , 2 ); /* п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ RR-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥         */
    TXT.STR_TXT.DLNOP [1] = 2;
   }
  else
   {
    memcpy ( TXT.STR_TXT.OPER , RX.BUF_OP_RX , 4);/* п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ RX-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥         */
    TXT.STR_TXT.DLNOP [1] = 4;
   }
  memcpy (TXT.STR_TXT.POLE9,ESD.STR_ESD.POLE11,8);/*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ */

  memcpy ( OBJTEXT[ITCARD] , TXT.BUF_TXT , 80 );  /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
  ITCARD += 1;                                    /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═б╟.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓-я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░.п©б╘п▒Б┬≥Б∙≈-я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─*/
  CHADR = CHADR + ARG;                            /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═б╟.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥ц╥ */
  return;
 }

int SDC()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DC    */
 {
  char *RAB;                                      /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒      */

  RX.OP_RX.OP   = 0;                              /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓     */
  RX.OP_RX.R1X2 = 0;                              /*п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ RX.OP_RX          */
  if
    (                                             /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒*/
     !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,/* я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙           */
	      "F'", 2)                            /* F',                    */
    )                                             /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡                     */
   {
    RAB=strtok                                    /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.RAB   */
	 (                                        /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
    (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND+2,/*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	  "'"                                     /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	 );

    RX.OP_RX.B2D2 = atoi ( RAB );                 /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ ASCII-> int     */
    RAB = (char *) &RX.OP_RX.B2D2;                /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙≥*/
    swab ( RAB , RAB , 2 );                       /* п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▓ п©б╘п▒Б┬≥б╟п©б╘п▒Б┬ Б▄═п©б╘п╠Б∙÷                 */
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒                   */
   return (1);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒     */

  STXT (4);                                       /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ TXT-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */


  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.*/
 }
/*..........................................................................*/
int SDS()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.DS    */
 {

  RX.OP_RX.OP   = 0;                              /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓     */
  RX.OP_RX.R1X2 = 0;                              /*п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ RX.OP_RX          */
  if
    (                                             /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒*/
     TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F' /* я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ F'        */
    )                                             /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:                    */
   RX.OP_RX.B2D2 = 0;                             /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥ RX.OP_RX.B2D2   */
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒                   */
   return (1);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒     */

  STXT (4);                                       /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ TXT-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */

  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.*/
 }
/*..........................................................................*/
int SEND()                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.END   */
 {
						  /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒            */
  memcpy (                                        /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒  */
	  END.STR_END.POLE9 ,                     /* END - п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─            */
	  ESD.STR_ESD.POLE11,                     /*                        */
	  8                                       /*                        */
	 );                                       /*                        */
  memcpy (                                        /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	  OBJTEXT[ITCARD],                        /* п©б╘п▒Б┬≥Б∙▒                      */
	  END.BUF_END,                            /* п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒                 */
	  80                                      /* п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
	 );                                       /* п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└                   */
  ITCARD += 1;                                    /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═б╟.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓-я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░.п©б╘п▒Б┬≥Б∙≈-я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─*/
  return (100);                                   /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ я▐Б√░п▒Б√═Б■▄ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥ц╥ 2-п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡*/
						  /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥               */
 }
/*..........................................................................*/
int SEQU()                                        /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.EQU   */
 {
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.  */
 }
/*..........................................................................*/
int SSTART()                                      /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.START */
 {
  char *PTR;                                      /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─                   */
  char *METKA;                                    /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓                 */
  char *METKA1;                                   /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
  int J;                                          /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─            */
  int RAB;                                        /*                        */

  METKA1 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA1*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.METKA,   /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    " "                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );
  for ( J=0; J<=ITSYM; J++ )                      /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
   {                                              /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *METKA1 */
    METKA = strtok (
		    (char*) T_SYM[J].IMSYM , " "
		   );
    if( !strcmp ( METKA , METKA1 ) )              /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
     {                                            /*  п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─.*/
      RAB = CHADR - T_SYM[J].ZNSYM;               /*  п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙, п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥-*/
      PTR = (char *)&RAB;                         /*  п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙▒ */
      swab ( PTR , PTR , 2 );                     /*  я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▓ п©б╘п▒Б┬≥б╟п©б╘п▒Б┬ Б√⌠п©б╘п╠Б∙÷, п©б╘п▒Б┬≥Б∙∙ */
      ESD.STR_ESD.DLPRG [0] = 0;                  /*  п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒ ESD-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒*/
      ESD.STR_ESD.DLPRG [1] = *PTR;               /*  п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡              */
      ESD.STR_ESD.DLPRG [2] = *(PTR + 1);         /*                        */
      CHADR = T_SYM[J].ZNSYM;                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤.CHADR, я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥  */
						  /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.START   */
						  /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥        */
      PTR = (char *)&CHADR;                       /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ ADPRG */
      ESD.STR_ESD.ADPRG[2]  = *PTR;               /*ESD-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒     */
      ESD.STR_ESD.ADPRG[1]  = *(PTR+1);           /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡        */
      ESD.STR_ESD.ADPRG[0]  = '\x00';             /*п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▓ п©б╘п▒Б┬≥б╟п©б╘п▒Б┬ Б▄═п©б╘п╠Б∙÷    */
      memcpy (                                    /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒            */
	       ESD.STR_ESD.IMPR ,                 /* п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─        */
	       METKA ,                            /*  п©б╘п▒Б┬≥Б∙∙                     */
	       strlen ( METKA )                   /*                        */
	     );                                   /*                        */
      memcpy (                                    /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒  */
	       ESD.STR_ESD.POLE11 ,               /* ESD - п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─            */
	       METKA ,                            /*                        */
	       strlen ( METKA )                   /*                        */
	     );                                   /*                        */
      memcpy (                                    /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	       OBJTEXT[ITCARD] ,                  /* п©б╘п▒Б┬≥Б∙▒                      */
	       ESD.BUF_ESD ,                      /* п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒                 */
	       80                                 /* п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
	     );                                   /* п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└                   */
      ITCARD += 1;                                /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═б╟.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓-я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░.п©б╘п▒Б┬≥Б∙≈-я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─*/
      return (0);                                 /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─*/
     }
   }
  return (2);                                     /*п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─. */
 }
/*..........................................................................*/
int SUSING()                                      /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.USING */
 {
						  /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─                   */
  char *METKA;                                    /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓                 */
  char *METKA1;                                   /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
  char *METKA2;                                   /*                        */
  int J;                                          /*                        */
  int NBASRG;                                     /*                        */
  METKA1 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA1*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    ","                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );
  METKA2 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA2*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
	    NULL,                                 /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    " "                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );
  if ( isalpha ( (int) *METKA2 ) )                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ */
   {                                              /*я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:            */

    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *METKA2 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
       {                                          /*  п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒   */
	 if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f ) /*  п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ NBASRG п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤.*/
	  goto SUSING1;                           /*  NBASRG <= 0x0f п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥*/
						  /*  я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ .я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─   */
	 else                                     /* п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                 */
	  return (6);                             /*  я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒   */

       }
     }
    return (2);                                   /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒  */
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.*/
   {                                              /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ я▐Б√░п▒Б√═Б■▄ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
    NBASRG = atoi ( METKA2 );                     /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙▒ NBASRG  */
    if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f )      /* п©б╘п▒Б┬≥Б∙∙,п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙  <= 0x0f,я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:  */
     goto SUSING1;                                /* п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ .я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌.п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─ */
    else                                          /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                  */
     return (6);                                  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒    */
   }

 SUSING1:                                         /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌. */

  T_BASR [NBASRG - 1].PRDOST = 'Y';               /* п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ .  */
  if ( *METKA1 == '*' )                           /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤-п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓ == '*',*/
   {
    T_BASR[NBASRG-1].SMESH = CHADR;               /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б┬ Б■─ ==CHADR*/
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                  */
   {
    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *METKA1 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
       {                                          /*  п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√   */
	T_BASR[NBASRG-1].SMESH = T_SYM[J].ZNSYM;  /*  я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■я▐Б√░п▒Б√═Б√▒   */
       }
     }
    return (2);                                   /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░*/
   }
  return (0);                                     /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─*/
 }
/*..........................................................................*/
int SRR()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RR-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
 {
  char *METKA;                                    /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─                   */
  char *METKA1;                                   /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓                 */
  char *METKA2;                                   /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
  unsigned char R1R2;                             /*                        */
  int J;                                          /*                        */
  RR.OP_RR.OP = T_MOP[I3].CODOP;                  /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟*/

  METKA1 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA1*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    ","                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );

  METKA2 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA2*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
	    NULL,                                 /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    " "                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );

  if ( isalpha ( (int) *METKA1 ) )                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ */
   {                                              /*я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *METKA1 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
       {                                          /*  п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√   */
	 R1R2 = T_SYM[J].ZNSYM << 4;              /*  п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.*/
	 goto SRR1;
       }                                          /*  п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     }
    return(2);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒."п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═"*/
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ */
   {                                              /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     R1R2 = atoi ( METKA1 ) << 4;                 /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.   п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─  */
   }


 SRR1:


  if ( isalpha ( (int) *METKA2 ) )                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ */
   {                                              /*я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *п©б╘п╠Б∙÷п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√⌠п©б╘п╠Б∙░п©б╘п▒Б┬ Б√▓2 */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
       {                                          /*  п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√   */
	 R1R2 = R1R2 + T_SYM[J].ZNSYM;            /*  п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─.*/
	 goto SRR2;                               /*                        */
       }                                          /*  п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     }                                            /*                        */
    return(2);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒."п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═"*/
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ */
   {                                              /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     R1R2 = R1R2 + atoi ( METKA2 );               /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.   п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─  */
   }

 SRR2:

  RR.OP_RR.R1R2 = R1R2;                           /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─-п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡-п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√*/
						  /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б┬ Б■─                 */

  STXT(2);
  return(0);                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─   */
 }

/*..........................................................................*/
int SRX()                                         /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.RX-я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥. */
 {
  char *METKA;                                    /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─                   */
  char *METKA1;                                   /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓                 */
  char *METKA2;                                   /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
  char *PTR;                                      /*                        */
  int  DELTA;                                     /*                        */
  int  ZNSYM;                                     /*                        */
  int  NBASRG;                                    /*                        */
  int J;                                          /*                        */
  int I;                                          /*                        */
  unsigned char R1X2;                             /*                        */
  int B2D2;                                       /*                        */
  RX.OP_RX.OP = T_MOP[I3].CODOP;                  /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟*/
  METKA1 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA1*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
    (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    ","                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );

  METKA2 = strtok                                 /*п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. c я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└.METKA2*/
	   (                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */
	    NULL,                                 /*п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
	    " "                                   /*п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓   */
	   );

  if ( isalpha ( (int) *METKA1 ) )                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ */
   {                                              /*я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *METKA  */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA1 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */

       {                                          /*  п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б┬ Б■╛я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√   */
	 R1X2 = T_SYM[J].ZNSYM << 4;              /*  п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.*/
	 goto SRX1;
       }                                          /*  п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     }
    return(2);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒."п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═"*/
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ */
   {                                              /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     R1X2 = atoi ( METKA1 ) << 4;                 /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.   п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─  */
   }


 SRX1:


  if ( isalpha ( (int) *METKA2 ) )                /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б√▒ */
   {                                              /*я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:            */
    for ( J=0; J<=ITSYM; J++ )                    /* п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ */
     {                                            /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤. T_SYM я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥. *п©б╘п╠Б∙÷п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√⌠п©б╘п╠Б∙░п©б╘п▒Б┬ Б√▓  */
      METKA = strtok (
		      (char*) T_SYM[J].IMSYM , " "
		     );
      if( !strcmp ( METKA , METKA2 ) )            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙:      */
       {                                          /*  я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠.: */
	NBASRG = 0;                               /*   п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒.я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥*/
	DELTA  = 0xfff - 1;                       /*   п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .,п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌠п©б╘п▒Б┬≥я▒*/
	ZNSYM  = T_SYM[J].ZNSYM;                  /*   я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ */
	for ( I=0; I<15; I++ )                    /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓   */
	 {                                        /*я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌-я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥ */
	  if (                                    /*я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└, п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└:     */
	       T_BASR[I].PRDOST == 'Y'            /* п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙,      */
	      &&                                  /*  п©б╘п▒Б┬≥Б∙∙                     */
	       ZNSYM - T_BASR[I].SMESH >= 0       /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■■я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ */
	      &&                                  /* п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒,п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒   */
	       ZNSYM - T_BASR[I].SMESH < DELTA    /* п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡-*/
	     )                                    /* я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥          */
	   {
	    NBASRG = I + 1;
	    DELTA  = ZNSYM - T_BASR[I].SMESH;
	   }
	 }
	if ( NBASRG == 0 || DELTA > 0xfff )       /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■.я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌.п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.,я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡*/
	 return(5);                               /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒ */
	else                                      /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒                   */
	 {                                        /* я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ */
	  B2D2 = NBASRG << 12;                    /* п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡  */
	  B2D2 = B2D2 + DELTA;                    /* п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒ B2D2   */
	  PTR = (char *)&B2D2;                    /* п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б┴╓ п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▓ п©б╘п▒Б┬≥б╟п©б╘п▒Б┬ Б▄═п©б╘п╠Б∙÷ */
	  swab ( PTR , PTR , 2 );                 /* я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■■я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥-п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б┬ Б■─*/
	  RX.OP_RX.B2D2 = B2D2;
	 }
	goto SRX2;                                /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓.п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥.п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡   */
       }                                          /*  п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
     }
    return(2);                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒."п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤.п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═"*/
   }
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒, п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒ */
   {                                              /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥*/
    return(4);                                    /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─.   п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─  */
   }

 SRX2:

  RX.OP_RX.R1X2 = R1X2;                           /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙▒.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥  */

  STXT(4);                                        /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ TXT-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─  */
  return(0);                                      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─   */
 }
/*..........................................................................*/
int SOBJFILE()                                    /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙ . */
 {                                                /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥                   */
  FILE *fp;                                       /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓           */
  int RAB2;                                       /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓              */
						  /*я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒-*/
  strcat ( NFIL , "tex" );                        /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥     */
  if ( (fp = fopen ( NFIL , "wb" )) == NULL )     /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б√═-п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ */
   return (-7);                                   /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒    */
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                  */
   RAB2 =fwrite (OBJTEXT, 80 , ITCARD , fp);      /* я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░.я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥*/
  fclose ( fp );                                  /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤*/
  return ( RAB2 );                                /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥  п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б√═Б√▒ */

 }
/*..........................................................................*/
void INITUNION ()
 {

/*
***** п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙  п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≤ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б┬ Б√▒   п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ ESD-я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥
*****                             п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╙п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥
*/

  ESD.STR_ESD.POLE1      =  0x02;
  memcpy ( ESD.STR_ESD.POLE2, "ESD", 3 );
  memset ( ESD.STR_ESD.POLE3,  0x40, 6 );
  ESD.STR_ESD.POLE31 [0] = 0x00;
  ESD.STR_ESD.POLE31 [1] = 0x10;
  memset ( ESD.STR_ESD.POLE32, 0x40, 2 );
  ESD.STR_ESD.POLE4  [0] = 0x00;
  ESD.STR_ESD.POLE4  [1] = 0x01;
  memset ( ESD.STR_ESD.IMPR,   0x40, 8 );
  ESD.STR_ESD.POLE6      = 0x00;
  memset ( ESD.STR_ESD.ADPRG,  0x00, 3 );
  ESD.STR_ESD.POLE8      = 0x40;
  memset ( ESD.STR_ESD.DLPRG,  0x00, 3 );
  memset ( ESD.STR_ESD.POLE10, 0x40,40 );
  memset ( ESD.STR_ESD.POLE11, 0x40, 8 );

/*
***** п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙  п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≤ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б┬ Б√▒   п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ TXT-я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥
*****                             п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╙п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥
*/

  TXT.STR_TXT.POLE1      =  0x02;
  memcpy ( TXT.STR_TXT.POLE2, "TXT", 3 );
  TXT.STR_TXT.POLE3      =  0x40;
  memset ( TXT.STR_TXT.ADOP,   0x00, 3 );
  memset ( TXT.STR_TXT.POLE5,  0x40, 2 );
  memset ( TXT.STR_TXT.DLNOP,  0X00, 2 );
  memset ( TXT.STR_TXT.POLE7,  0x40, 2 );
  TXT.STR_TXT.POLE71 [0] = 0x00;
  TXT.STR_TXT.POLE71 [1] = 0x01;
  memset ( TXT.STR_TXT.OPER,   0x40,56 );
  memset ( TXT.STR_TXT.POLE9,  0x40, 8 );

/*
***** п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙  п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≤ п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═б╟ п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б┬ Б√▒   п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ END-я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤п©б╘п▒Б┬≥ц╥
*****                             п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╙п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥
*/

  END.STR_END.POLE1      =  0x02;
  memcpy ( END.STR_END.POLE2, "END", 3 );
  memset ( END.STR_END.POLE3,  0x40,68 );
  memset ( END.STR_END.POLE9,  0x40, 8 );

 }

/*..........................................................................*/

int main( int argc, char **argv )                /*п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥       */
 {
   FILE *fp;
   char *ptr = argv [1];
   unsigned char ASSTEXT [DL_ASSTEXT][80];

/*
******* п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б┴╓ п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓
*/

  int I1 , I2 , RAB;                              /* п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥      */

  INITUNION ();                                   /* п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б■■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒  */
						  /* п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒  */
						  /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╙-*/
						  /* п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡  я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥        */

/*
******       п©б╘п╠Б∙║ п©б╘п▒Б┬ Б√▓ п©б╘п▒Б┬≥Б┬  п©б╘п▒Б┬ Б√▓ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔   п©б╘я├Б∙╔ п©б╘п▒Б■╛Б┴╔ п©б╘п▒Б┬≥Б√▒ п©б╘п▒Б┬ Б▄═ п©б╘п╠Б∙╔ п©б╘п▒Б√└Б∙░ п©б╘п╠Б∙╔  п©б╘я├Б∙╔ п©б╘п▒Б┬≥Б√▒ п©б╘п╠Б∙╔ п©б╘п▒Б┬≥Б√▓ п©б╘п╠Б∙÷ п©б╘п╠Б∙╔ п©б╘п▒Б┬≥Б√⌠ п©б╘п▒Б┬≥Б√▒ п©б╘п▒Б┬ Б√▓      *****
*/
/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥ ASSTEXT, п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б┬ Б√└я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟-я▐Б√░п▒Б┬ Б√└ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙
*****          (п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙  п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ BORLANDC++ 2.0)
*/

  strcpy ( NFIL, ptr );

  if ( argc != 2 )

   {
    printf ( "%s\n", "п©б╘п╠Б∙╔я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒" );
    return 0;
   }


  if ( strcmp ( &NFIL [ strlen ( NFIL )-3 ], "ass" ) )

   {
    printf ( "%s\n", "п©б╘п╠Б∙║п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п╠Б∙≤ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥" );
    return 0;
   }


  else

   {
    if ( (fp = fopen ( NFIL , "rb" )) == NULL )   /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б√└.я▐Б√░п▒Б√═Б√═-п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ */
						  /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥я▒    */
     {
      printf ( "%s\n", "п©б╘п╠Б∙║п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙  я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤ я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙≥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥" );
      return 0;
     }

    else

     {
      for ( I1 = 0; I1 <= DL_ASSTEXT; I1++ )

       {
	if ( !fread ( ASSTEXT [I1], 80, 1, fp ) )
	 {
	  if ( feof ( fp ) )
	   goto main1;
	  else
	   {
	    printf ( "%s\n", "п©б╘п╠Б∙╔я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б∙⌠я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б√═я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б■▄ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥" );
	    return 0;
	   }
	 }
       }

      printf ( "%s\n", "п©б╘я├Б∙╔п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б∙⌠я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥" );
      return 0;
     }

   }

main1:

   fclose ( fp );
   NFIL [ strlen ( NFIL )-3 ] = '\x0';

/*
***** п©б╘п╠Б∙░ п©б╘п╠Б∙╔ п©б╘п╠Б∙║ п©б╘п▒Б■╛Б┴╔ п©б╘п▒Б┬≥Б┬≥ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙
*/

  for ( I1=0; I1 < DL_ASSTEXT; I1++ )             /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└ я▐Б√░п▒Б√═Б■▄ 1 п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└*/
   {                                              /*                        */
    memcpy ( TEK_ISX_KARTA.BUFCARD , ASSTEXT[I1], /*я▐Б√░п▒Б√═Б∙⌠-я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═*/
					     80 );/*                        */
    if (TEK_ISX_KARTA.STRUCT_BUFCARD.METKA [0] == /*п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙  */
					     ' ') /*п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙                   */
     goto CONT1;                                  /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ CONT1,               */
						  /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                  */
    ITSYM += 1;                                   /* п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙≈ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓.я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.TSYM*/
    PRNMET = 'Y';                                 /* я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ .п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙*/
    memcpy ( T_SYM[ITSYM].IMSYM ,                 /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б√▒ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥  */
	TEK_ISX_KARTA.STRUCT_BUFCARD.METKA , 8 ); /* п©б╘п▒Б┬≥Б∙∙                      */
    T_SYM[ITSYM].ZNSYM = CHADR;                   /* п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒(п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б■─.) */

/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√
*/

   CONT1:

    for ( I2=0; I2 < NPOP; I2++ )                 /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
     {                                            /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:     */
      if(                                         /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒         */
	      T_POP[I2].MNCPOP , 5)               /* я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥,            */
	)                                         /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:                    */
						  /*                        */
       { switch ( T_POP[I2].BXPROG () )           /* я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ */
	 {
	  case 0:
	   goto CONT2;                            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤       */
	  case 1:
	   goto ERR1;
	  case 100:
	   goto CONT3;
	 }
       }                                          /*                        */
     }                                            /*                        */

    for ( I3=0; I3 < NOP ; I3++ )                 /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░.п©б╘п▒Б┬≥Б∙≥.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.*/
     {                                            /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:    */
      if(                                         /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒      */
	      T_MOP[I3].MNCOP , 5)                /* я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥,            */
	)                                         /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡:                    */
						  /*                        */
       {
	 T_MOP[I3].BXPROG ();                     /* я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ */
	 PRNMET = 'N';                            /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙*/
	 goto CONT2;                              /* п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤       */
       }
     }

    goto ERR3;                                    /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.'п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤.'*/


 CONT2:
    continue;                                     /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═б╟ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙   */
   }                                              /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥         */


/*
******       п©б╘п╠Б∙║ п©б╘п▒Б┬ Б√▓ п©б╘п▒Б┬≥Б┬  п©б╘п▒Б┬ Б√▓ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔   п©б╘п▒Б┬ Б▄═ п©б╘п▒Б┬≥Б√⌠ п©б╘п╠Б∙╔ п©б╘п▒Б┬≥Б√▒ п©б╘п╠Б∙╔ п©б╘п▒Б√└Б∙░ п©б╘п╠Б∙╔  п©б╘я├Б∙╔ п©б╘п▒Б┬≥Б√▒ п©б╘п╠Б∙╔ п©б╘п▒Б┬≥Б√▓ п©б╘п╠Б∙÷ п©б╘п╠Б∙╔ п©б╘п▒Б┬≥Б√⌠ п©б╘п▒Б┬≥Б√▒ п©б╘п▒Б┬ Б√▓      *****
*/

CONT3:

 T_MOP[0].BXPROG = SRR;                           /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙    */
 T_MOP[1].BXPROG = SRR;                           /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙*/
 T_MOP[2].BXPROG = SRX;                           /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙   */
 T_MOP[3].BXPROG = SRX;                           /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒        */
 T_MOP[4].BXPROG = SRX;
 T_MOP[5].BXPROG = SRX;

 T_POP[0].BXPROG = SDC;                           /*я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙    */
 T_POP[1].BXPROG = SDS;                           /*п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░-п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙*/
 T_POP[2].BXPROG = SEND;                          /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓ п©б╘п▒Б┬ Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б┬≥Б√▓п©б╘п▒Б■╛Б┴╔п©б╘п╠Б∙÷п©б╘п▒Б┬ Б√⌠п©б╘п▒Б√└Б∙▒п©б╘п▒Б■╛Б┴╔п©б╘п▒Б┬≥Б√▒п©б╘п▒Б┬ Б√▓ */
 T_POP[3].BXPROG = SEQU;                          /*п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒    */
 T_POP[4].BXPROG = SSTART;
 T_POP[5].BXPROG = SUSING;

  for ( I1=0; I1 < DL_ASSTEXT; I1++ )             /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└ я▐Б√░п▒Б√═Б■▄ 1 п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└*/
   {     					  /*                        */
    memcpy ( TEK_ISX_KARTA.BUFCARD , ASSTEXT [I1],/*я▐Б√░п▒Б√═Б∙⌠-я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙ .п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б√▒ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б√═*/
					     80 );/*                        */
/*
***** п©б╘п▒Б┬ Б√⌠ п©б╘п▒Б√└Б∙▒ п©б╘п╠Б∙╔ п©б╘п╠Б∙░  п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙√
*/

    for ( I2=0; I2 < NPOP; I2++ )                 /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░.п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─*/
     {                                            /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:     */
      if(                                         /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒         */
	      T_POP[I2].MNCPOP , 5)               /* я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥,            */
	)                                         /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡                     */
						  /*                        */
       { switch ( T_POP[I2].BXPROG () )           /* я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ */
	 {
	  case 0:
	   goto CONT4;                            /* п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤       */
	  case 100:                               /*я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒    */
	   goto CONT5;                            /*п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥        */
	 }
       }                                          /*                        */
     }                                            /*                        */

    for ( I3=0; I3 < NOP ; I3++ )                 /*п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б┴╓ я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░.п©б╘п▒Б┬≥Б∙≥.п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─.*/
     {                                            /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б┬ Б√└я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥я▒:    */
      if(                                         /* п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙                   */
      !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒      */
	      T_MOP[I3].MNCOP , 5)                /* я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥             */
	)                                         /* я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡                     */
						  /*                        */
       {
	 switch ( T_MOP[I3].BXPROG () )           /* я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙√я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п╠Б∙≤п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─.п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙ */
	  {
	   case 0:
	    goto CONT4;                           /* п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤       */

	   case 2:                                /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒  */
	    goto ERR2;                            /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒               */

	   case 4:                                /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒  */
	    goto ERR4;                            /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒               */

	   case 5:                                /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒  */
	    goto ERR5;                            /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒               */

	   case 6:                                /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒  */
	    goto ERR6;                            /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒               */

	   case 7:                                /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒  */
	    goto ERR6;                            /*я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒               */

	  }
	}

     }

 CONT4:
   continue;                                      /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═б╟ я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙∙   */
   }                                              /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б┴╓.я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥         */

CONT5:

  if ( ITCARD == (RAB = SOBJFILE ()) )            /*п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤   */
						  /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■─, я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡: */
   printf                                         /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░ я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥  */
    (                                             /* п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙             */
     "%s\n",
     "я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙≤я▐Б√░п▒Б┬ Б√▒я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙"
    );
  else                                            /*п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥я▒:                  */
   {
    if ( RAB == -7 )
     goto ERR7;
    else
     printf                                       /* я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥я▒ п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б√▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б∙⌠п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥  */
      (                                           /* я▐Б√░п▒Б√═Б√═я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ */
       "%s\n",                                    /* я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥                  */
       "п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙∙ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥"
      );
   }
    return 0;                                       /*п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ main-п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─.   */

ERR1:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б┴╓");        /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR2:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'я▐Б√░п▒Б┬ Б√▒п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙ я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─");  /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR3:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═б╟п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙∙");         /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR4:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙⌡ п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥");      /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR5:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙■п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙▒п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒");           /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR6:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙⌡п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б√▒я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙√ п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═Б■─ я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥я▒п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥");  /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;

ERR7:
  printf ("%s\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б┬ Б■─я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б┬ Б√▒ п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░'п©б╘п▒Б┬≥я▒п©б╘п▒Б┬≥Б∙≈я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙ .я▐Б√░п▒Б√═Б√═п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙√п©б╘п▒Б┬≥Б∙≤п©б╘п▒Б┬≥ц╥");/*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/
  goto CONT6;


CONT6:
  printf ("%s%d\n","п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б∙⌡п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥Б∙░п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥ п©б╘п▒Б┬≥Б∙▒ п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б■─я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥я▒ N ",I1+1);     /*п©б╘п▒Б┬≥Б∙▒я▐Б√░п▒Б┬ Б■─п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥ц╥я▐Б√░п▒Б√═Б√└я▐Б√░п▒Б┬ Б■■ п©б╘п▒Б┬≥Б∙▓п©б╘п▒Б┬≥Б∙∙п©б╘п▒Б┬≥ц╥п©б╘п©Б■┌п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥Б∙⌡я▐Б√░п▒Б√═Б■▄я▐Б√░п▒Б√═Б√└п©б╘п▒Б┬≥Б∙∙я▐Б√░п▒Б√═Б∙⌠.я▐Б√░п▒Б√═Б■▄п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙░я▐Б√░п▒Б√═Б∙╒.*/

 return 0;
 }                                                /*п©б╘п▒Б┬≥Б∙≈п©б╘п▒Б┬≥Б∙⌡п©б╘п▒Б┬≥Б∙ п©б╘п▒Б┬≥я▒я▐Б√░п▒Б√═б╟ main-п©б╘п╠Б∙≤я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥Б∙⌡п©б╘п©Б■┌я▐Б√░п▒Б√═Б■─п©б╘п▒Б┬≥ц╥п©б╘п▒Б┬≥Б∙≥п©б╘п▒Б┬≥Б∙≥я▐Б√░п▒Б┬ Б■─    */

