/*
***** Н А Ч А Л О   файла компилятора с языка высокого уровня
*/

/*
***** Б л о к  об'явлений макроопределений
*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
/* п р е д е л ь н ы е    */
/* размеры:               */
#define MAXNISXTXT 50                             /* - исходного текста;    */
#define NSINT     248                             /* - табл.синтакс.правил; */
#define NCEL       20                             /* - стека целей;         */
#define NDST      500                             /* - стека достижений;    */
#define NVXOD      62                             /* - табл.входов;         */
#define NSTROKA   1000                             /* - строки плотн.текста; */
#define NNETRM     19                             /* - списка нетерминалов; */
#define MAXLTXT    50                             /* - выходного текста;    */
#define MAXFORMT   30                             /* - форматированного ин- */
/* терпретируемого  фраг- */
/* мента исх.текста;      */
#define NSYM      100                             /* - таблицы имен и меток */

/*
***** Б а з а  данных компилятора
*/

/*
***** Б л о к  об'явления массива с исходным текстом
*/

int NISXTXT;                                     /* длина массива          */
char ISXTXT[MAXNISXTXT][80];                     /* тело массива           */

/*
***** Б л о к  об'явления рабочих переменных
*/

int I1, I2, I3, I4;                                  /* счетчики циклов        */

char PREDSYM = ' ';                               /*последний обработанный  */


char STROKA[NSTROKA];                          /*место хранения уплотнен-*/

int I, J, K, L;                                      /*текущие индексы соответ-*/


union                                             /*шаблон для генерации    */
{                                                /*записи выходного файла  */
    char BUFCARD[80];                           /*на АССЕМБЛЕРЕ IBM 370   */
    struct {
        char METKA[8];
        char PROB1;
        char OPERAC[5];
        char PROB2;
        char OPERAND[12];
        char PROB3;
        char COMM[52];
    } _BUFCARD;
} ASS_CARD;

char ASSTXT[MAXLTXT][80];                      /*массив для хранения     */

int IASSTXT;                                     /*индекс выходного массива*/

char FORMT[MAXFORMT][9];                        /*массив для форматирован-*/

int IFORMT;                                      /*индекс форматированного */

// структура таблицы свертки
struct {
    char DST1[4];
    int DST2;
    int DST3;
    int DST4;
    int DST5;
} DST[NDST];

// Структура, которая хранит в себе
struct {
    char CEL1[4];
    int CEL2;
    int CEL3;
} CEL[NCEL];

// Структура правил грамматики
struct {
    int POSL; // следующее состояние
    int PRED; // предыдущее состояние
    char DER[4]; // символ автомата
    int ALT; // альтернативный путь если следующее состояние не подошло
} SINT[NSINT] = {
        {-1,  -1,  "***", -1},

        {2,   0,   "0  ", 0},
        {3,   1,   "CIF", 0},
        {0,   2,   "*  ", 0},

        {5,   0,   "1  ", 0},
        {6,   4,   "CIF", 7},
        {0,   5,   "*  ", 0},

        {8,   4,   "MAN", 0},
        {0,   7,   "*  ", 0},

        {10,  0,   "2  ", 0},
        {11,  9,   "CIF", 0},
        {0,   10,  "*  ", 0},

        {13,  0,   "3  ", 0},
        {14,  12,  "CIF", 0},
        {0,   13,  "*  ", 0},

        {16,  0,   "4  ", 0},
        {17,  15,  "CIF", 0},
        {0,   16,  "*  ", 0},

        {19,  0,   "5  ", 0},
        {20,  18,  "CIF", 0},
        {0,   19,  "*  ", 0},

        {22,  0,   "6  ", 0},
        {23,  21,  "CIF", 0},
        {0,   22,  "*  ", 0},

        {25,  0,   "7  ", 0},
        {26,  24,  "CIF", 0},
        {0,   25,  "*  ", 0},

        {28,  0,   "8  ", 0},
        {29,  27,  "CIF", 0},
        {0,   28,  "*  ", 0},

        {31,  0,   "9  ", 0},
        {32,  30,  "CIF", 0},
        {0,   31,  "*  ", 0},

        {34,  0,   "A  ", 0},
        {35,  33,  "BUK", 0},
        {0,   34,  "*  ", 0},

        {37,  0,   "B  ", 0},
        {38,  36,  "BUK", 0},
        {0,   37,  "*  ", 0},

        {40,  0,   "C  ", 0},
        {41,  39,  "BUK", 0},
        {0,   40,  "*  ", 0},

        {43,  0,   "D  ", 0},
        {44,  42,  "BUK", 45},
        {0,   43,  "*  ", 0},

        {46,  42,  "C  ", 0},
        {47,  45,  "L  ", 0},
        {48,  46,  "   ", 0},
        {49,  47,  "IDE", 0},
        {50,  48,  "   ", 0},
        {51,  49,  "B  ", 187},
        {52,  50,  "I  ", 0},
        {53,  51,  "N  ", 0},
        {54,  52,  "   ", 0},
        {55,  53,  "F  ", 0},
        {56,  54,  "I  ", 0},
        {57,  55,  "X  ", 0},
        {58,  56,  "E  ", 0},
        {59,  57,  "D  ", 0},
        {60,  58,  "(  ", 0},
        {61,  59,  "RZR", 0},
        {62,  60,  ")  ", 0},
        {63,  61,  ";  ", 65},
        {64,  62,  "ODC", 0},
        {65,  63,  "*  ", 0},

        {66,  61,  "I  ", 0},
        {67,  65,  "N  ", 0},
        {68,  66,  "I  ", 0},
        {69,  67,  "T  ", 0},
        {70,  68,  "(  ", 0},
        {71,  69,  "LIT", 0},
        {72,  70,  ")  ", 0},
        {73,  71,  ";  ", 0},
        {186, 72,  "ODC", 0},

        {75,  0,   "E  ", 0},
        {76,  74,  "N  ", 82},
        {77,  75,  "D  ", 0},
        {78,  76,  "   ", 0},
        {79,  77,  "IPR", 0},
        {80,  78,  ";  ", 0},
        {81,  79,  "OEN", 0},
        {0,   80,  "*  ", 0},

        {83,  74,  "BUK", 0},
        {0,   82,  "*  ", 0},

        {85,  0,   "M  ", 0},
        {86,  84,  "BUK", 0},
        {0,   85,  "*  ", 0},

        {88,  0,   "P  ", 0},
        {89,  87,  "BUK", 0},
        {0,   88,  "*  ", 0},

        {91,  0,   "X  ", 0},
        {92,  90,  "BUK", 0},
        {0,   91,  "*  ", 0},

        {94,  0,   "BUK", 0},
        {95,  93,  "IDE", 0},
        {0,   94,  "*  ", 0},

        {97,  0,   "IDE", 0},
        {98,  96,  "BUK", 100},
        {99,  97,  "IDE", 0},
        {0,   98,  "*  ", 0},

        {101, 96,  "CIF", 103},
        {102, 100, "IDE", 0},
        {0,   101, "*  ", 0},

        {104, 96,  "IPE", 105},
        {0,   103, "*  ", 0},

        {106, 96,  "IPR", 0},
        {0,   105, "*  ", 0},

        {108, 0,   "+  ", 0},
        {109, 107, "ZNK", 0},
        {0,   108, "*  ", 0},

        {111, 0,   "-  ", 0},
        {112, 110, "ZNK", 0},
        {0,   111, "*  ", 0},

        {114, 0,   "IPR", 0},
        {115, 113, ":  ", 0},
        {116, 114, "P  ", 0}, // PROC
        {117, 115, "R  ", 0}, // PROC
        {118, 116, "O  ", 0}, // PROC
        {119, 117, "C  ", 0}, // PROC
        {120, 118, "   ", 0}, //
        {121, 119, "O  ", 0}, // OPTIONS
        {122, 120, "P  ", 0}, // OPTIONS
        {123, 121, "T  ", 0}, // OPTIONS
        {124, 122, "I  ", 0}, // OPTIONS
        {125, 123, "O  ", 0}, // OPTIONS
        {126, 124, "N  ", 0}, // OPTIONS
        {127, 125, "S  ", 0}, // OPTIONS
        {128, 126, "(  ", 0}, // (
        {129, 127, "M  ", 0}, // MAIN
        {130, 128, "A  ", 0}, // MAIN
        {131, 129, "I  ", 0}, // MAIN
        {132, 130, "N  ", 0}, // MAIN
        {133, 131, ")  ", 0}, // )
        {134, 132, ";  ", 0}, // ;
        {135, 133, "OPR", 0},
        {0,   134, "*  ", 0},

        {137, 0,   "CIF", 0},
        {138, 136, "RZR", 0},
        {0,   0,   "*  ", 0},

        {140, 0,   "RZR", 0},
        {141, 139, "CIF", 0},
        {142, 140, "RZR", 0},
        {0,   141, "*  ", 0},

        {144, 0,   "MAN", 0},
        {145, 143, "B  ", 147},
        {146, 144, "LIT", 0},
        {0,   145, "*  ", 0},

        {148, 143, "0  ", 150},
        {149, 147, "MAN", 0},
        {0,   148, "*  ", 0},

        {151, 143, "1  ", 0},
        {152, 150, "MAN", 0},
        {0,   151, "*  ", 0},

        {154, 0,   "IPE", 0},
        {155, 153, "=  ", 159},
        {156, 154, "AVI", 0},
        {157, 155, ";  ", 0},
        {158, 156, "OPA", 0},
        {0,   157, "*  ", 0},

        {160, 153, "AVI", 0},
        {0,   159, "*  ", 0},

        {162, 0,   "LIT", 0},
        {163, 161, "AVI", 0},
        {0,   162, "*  ", 0},

        {165, 0,   "AVI", 0},
        {166, 164, "ZNK", 0},
        {167, 165, "LIT", 168},
        {197, 166, "AVI", 0},

        {169, 165, "IPE", 0},
        {170, 168, "AVI", 0},
        {0,   169, "*  ", 0},

        {172, 0,   "OPR", 0},
        {173, 171, "TEL", 0},
        {174, 172, "OEN", 0},
        {175, 173, "PRO", 0},
        {0,   174, "*  ", 0},

        {177, 0,   "ODC", 0},
        {178, 176, "TEL", 0},
        {0,   177, "*  ", 0},

        {180, 0,   "TEL", 0},
        {181, 179, "ODC", 183},
        {182, 180, "TEL", 0},
        {0,   181, "*  ", 0},

        {184, 179, "OPA", 0},
        {185, 183, "TEL", 0},
        {0,   184, "*  ", 0},

        {0,   73,  "*  ", 0},

        {188, 49,  "C  ", 0},
        {189, 187, "H  ", 0},
        {190, 188, "A  ", 0},
        {191, 189, "R  ", 0},
        {192, 190, "(  ", 0},
        {193, 191, "RZR", 0},
        {194, 192, ")  ", 0},
        {195, 193, ";  ", 0},
        {196, 194, "ODC", 0},
        {0,   195, "*  ", 0},

        {0,   166, "*  ", 0},

        {199, 0,   "*  ", 0},
        {200, 198, "ZNK", 0},
        {0,   199, "*  ", 0},

        {202, 0,   "AVI", 0}, // AVI < AVI
        {203, 201, "<  ", 206}, // AVI < AVI
        {204, 202, "AVI", 0}, // AVI < AVI
        {0,   203, "*  ", 0}, // AVI < AVI

        {206, 0,   "AVI", 0}, // AVI > AVI
        {207, 205, ">  ", 210}, // AVI > AVI
        {208, 206, "AVI", 0}, // AVI > AVI
        {0,   207, "*  ", 0}, // AVI > AVI

        {210, 0,   "AVI", 0}, // AVI = AVI
        {211, 209, "=  ", 0}, // AVI = AVI
        {212, 210, "AVI", 0}, // AVI = AVI
        {0,   211, "*  ", 0}, // AVI = AVI

        {214, 0,   "D  ", 0}, // DO
        {215, 213, "O  ", 0}, // DO
        {216, 214, "   ", 0}, // DO

        {217, 215, "IPE", 0}, // N
        {218, 216, "=  ", 0},
        {219, 217, "AVI", 0}, // 1

        {220, 218, "T  ", 0}, // TO
        {221, 219, "O  ", 0},
        {222, 220, "   ", 0},

        {223, 221, "AVI", 0},     // 5
        {224, 222, ",  ", 0},
        {225, 223, "   ", 0},

        {226, 224, "W  ", 0},     // WHILE
        {227, 225, "H  ", 0},
        {228, 226, "I  ", 0},
        {229, 227, "L  ", 0},
        {230, 228, "E  ", 0},

        {231, 229, "(  ", 0},
        {232, 230, "USL", 0},     // S < 20
        {233, 231, ")  ", 0},
        {234, 232, ";  ", 0},

        {235, 233, "OPA", 0},

        {239, 234, "OED", 0},
        {237, 235, "N  ", 0}, // TODO удалить
        {238, 236, "D  ", 0}, // TODO удалить
        {239, 237, ";  ", 0}, // TODO удалить

        {0,   235, "*  ", 0},
        {241, 0,   "E  ", 0}, // END;
        {242, 240, "N  ", 0}, // END;
        {243, 241, "D  ", 0}, // END;
        {244, 242, ";  ", 0}, // END;
        {0,   243, "*  ", 0}, // END;
};

// таблица хранит описание терминалов/нетерминалов, где
// T = терминал
// N = нетерминал
struct {
    char SYM[4]; // символ
    int VX; // правило символа SINT
    char TYP; // тип нетерминал/терминал
} VXOD[NVXOD] = {
        {"AVI", 164, 'N'},
        {"BUK", 93,  'N'},
        {"CIF", 136, 'N'},
        {"IDE", 96,  'N'},
        {"IPE", 153, 'N'},
        {"IPR", 113, 'N'},
        {"LIT", 161, 'N'},
        {"MAN", 143, 'N'},
        {"ODC", 176, 'N'},
        {"OEN", 0,   'N'},
        {"OPA", 0,   'N'},
        {"OPR", 171, 'N'},
        {"PRO", 0,   'N'},
        {"RZR", 139, 'N'},
        {"TEL", 179, 'N'},
        {"ZNK", 0,   'N'},
        {"NUM", 222, 'N'},
        {"LAB", 0,   'N'},
        {"OGT", 0,   'N'},
        {"USL", 201, 'N'}, // нетерминал условие
        {"ODO", 213, 'N'}, // нетерминал цикла WHL
        {"OED", 240, 'N'},
        {"A  ", 33,  'T'},
        {"B  ", 36,  'T'},
        {"C  ", 39,  'T'},
        {"D  ", 42,  'T'},
        {"E  ", 74,  'T'},
        {"M  ", 84,  'T'},
        {"P  ", 87,  'T'},
        {"X  ", 90,  'T'},
        {"0  ", 1,   'T'},
        {"1  ", 4,   'T'},
        {"2  ", 9,   'T'},
        {"3  ", 12,  'T'},
        {"4  ", 15,  'T'},
        {"5  ", 18,  'T'},
        {"6  ", 21,  'T'},
        {"7  ", 24,  'T'},
        {"8  ", 27,  'T'},
        {"9  ", 30,  'T'},
        {"+  ", 107, 'T'},
        {"-  ", 110, 'T'},
        {":  ", 0,   'T'},
        {"I  ", 0,   'T'},
        {"R  ", 0,   'T'},
        {"N  ", 0,   'T'},
        {"O  ", 216, 'T'},
        {"T  ", 219, 'T'},
        {"S  ", 0,   'T'},
        {"(  ", 0,   'T'},
        {")  ", 0,   'T'},
        {"   ", 0,   'T'},
        {";  ", 0,   'T'},
        {"L  ", 201, 'T'},
        {"F  ", 0,   'T'},
        {"=  ", 0,   'T'},
        {"H  ", 0,   'T'},
        {"G  ", 204, 'T'},
        {"*  ", 198, 'T'},
        {"<  ", 0,   'T'},
        {">  ", 0,   'T'},
        {",  ", 0,   'T'},
};

//
char TPR[NVXOD][NNETRM] =
        {
/*                              AVI:    BUK:   CIF:   IDE:   IPE:   IPR:    LIT:   MAN:   ODC:    OEN:    OPA:    OPR:    PRO:    RZR:    TEL:    ZNK:    USL:     ODO      OED*/
                {/*AVI*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*BUK*/ 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*CIF*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {/*IDE*/ 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}, // идентификатор (последовательность букв и цифр)
                {/*IPE*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, // оператор присваивания
                {/*IPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0},
                {/*LIT*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*MAN*/ 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*ODC*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
                {/*OEN*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}, // конец программы
                {/*OPA*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1}, // последовательность операторов
                {/*OPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0}, // заголовок процедуры
                {/*PRO*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*RZR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {/*TEL*/ 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, // тело
                {/*ZNK*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*USL*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0}, // условие
                {/*ODO*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, // цикл do
                {/*OED*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, // END
                // терминалы
                {/*  A*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  B*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  C*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  D*/ 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  E*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  M*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  P*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  X*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  0*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  1*/ 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  2*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  3*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  4*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  5*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {/*  6*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
                {/*  7*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  8*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  9*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  +*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*  -*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*  :*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  I*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  R*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  N*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  O*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  T*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  S*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  (*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  )*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  ;*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*   */ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  L*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  F*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  =*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  H*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  **/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*  <*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*  >*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*  ,*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
        };

// фильтруем пробелы (на самом деле если почитать код, то работает очень плохо :D )
void compress_ISXTXT() {
    I3 = 0;
    for (I1 = 0; I1 <= NISXTXT; I1++) {
        for (I2 = 0; I2 < 80; I2++)
            if (ISXTXT[I1][I2] != '\x0') {
                // если текущий символ это пробел И предыдущий символ это что-то такое, то ничего не делаем
                if (ISXTXT[I1][I2] == ' ' &&
                    (PREDSYM == ' ' || PREDSYM == ';' || PREDSYM == ')' || PREDSYM == ':' || PREDSYM == '(' ||
                     PREDSYM == '<' || PREDSYM == '>' || PREDSYM == ',')) {
                    PREDSYM = ISXTXT[I1][I2];
                    goto L2;
                }
                // если текущий символ это +-=()* И предыдущий символ это пробел, то запоминаем этот символ в STROKA
                if ((ISXTXT[I1][I2] == '+' || ISXTXT[I1][I2] == '-' || ISXTXT[I1][I2] == '=' || ISXTXT[I1][I2] == '(' ||
                     ISXTXT[I1][I2] == ')' || ISXTXT[I1][I2] == '*' || ISXTXT[I1][I2] == '>' || ISXTXT[I1][I2] == '<' ||
                     ISXTXT[I1][I2] == ',') && PREDSYM == ' ') {
                    I3--;
                    goto L1;
                }
                // если текущий символ это пробел и предыдуший символ это +-=*, то ничего не делаем
                if (ISXTXT[I1][I2] == ' ' && (PREDSYM == '+' || PREDSYM == '-' || PREDSYM == '=' || PREDSYM == '*')) {
                    goto L2;
                }
                // запоминаем предыдущий символ как текущий, а в STROKA добавляем предыдуший символ
                L1:
                PREDSYM = ISXTXT[I1][I2];
                STROKA[I3] = PREDSYM;
                I3++;

                // следующая итерация
                L2:
                continue;
            } else {
                break;
            }
    }
    // в конце ставим символ конца
    STROKA[I3] = '\x0';
}


// достраиваем существующую матрицу TPR, проставляя единицы там, где есть достижимость между узлами графа
void build_TPR() {
    for (I1 = 0; I1 < NNETRM; I1++) {
        for (I2 = 0; I2 < NVXOD; I2++) {
            if (TPR[I2][I1] & (I1 != I2)) {
                for (I3 = 0; I3 < NNETRM; I3++)
                    TPR[I2][I3] |= TPR[I1][I3];
            }
        }
    }
}

// текущий стек разбора
void mcel(char *T1, int T2, int T3) {
    strcpy(CEL[K].CEL1, T1);
    CEL[K].CEL2 = T2;
    CEL[K].CEL3 = T3;
    K++;
}

void mdst(char *T1, int T2, int T3, int T4, int T5) {
    strcpy(DST[L].DST1, T1);
    DST[L].DST2 = T2;
    DST[L].DST3 = T3;
    DST[L].DST4 = T4;
    DST[L].DST5 = T5;
    L++;
}

int numb(char *T1, int T2) {
    int k;

    for (I1 = 0; I1 < NVXOD; I1++) {
        for (k = 0; k < T2; k++) {
            if ((*(T1 + k) != VXOD[I1].SYM[k]))
                goto numb1;
        }
        if ((VXOD[I1].SYM[k] == '\x0') ||
            (VXOD[I1].SYM[k] == ' ')
                )
            return (I1);
        numb1:
        continue;
    }
    return -1;
}

// синтаксический анализ
// возвращает 0 если все хорошо
int sint_ANAL() {
    I4 = 0;

    L1:
    K = 0;
    L = 0;
    I = 0;
    J = 1;
    // начало синтаксического разбора. Программа начинается с PRO
    mcel("PRO", I, 999);

    if (!TPR[numb(&STROKA[I], 1)][numb("PRO", 3)])
        return 1;

    // читаем правило анализатора
    L2:
    J = VXOD[numb(&STROKA[I], 1)].VX;
    printf("Прочитали VXOD. I=%d J=%d DER='%s' CHAR='%c'\n", I, J, SINT[J].DER, STROKA[I]);

    // обработка следующего состояния автомата
    L3:
    J = SINT[J].POSL;
    printf("Прочитали следующее правило. I=%d J=%d SINT CHAR='%s' CHAR='%c'\n", I, J, SINT[J].DER, STROKA[I]);
    if (J == -1) {
        return 1;
    }
    L31:
    I++;

    if (I > I4)
        I4 = I;

    // если текущее правило грамматики это терминал
    if (VXOD[numb(SINT[J].DER, 3)].TYP == 'T') {
        printf("Прочитали терминал: %s.J=%i \n", SINT[J].DER, J);
        // если входной символ в автомат совпадает с ожидаемым терминалом
        if (STROKA[I] == SINT[J].DER[0]) {
            printf("СОВПАЛО:  %c", STROKA[I]);
            // следующее состояние
            goto L3;
        } else {
            // иначе rollback
            printf("Текущий символ %c не совпал с символом правила %c \n", STROKA[I], SINT[J].DER[0]);
            goto L8;
        }
    }

    // если распознан нетерминал
    L4:
    if (SINT[SINT[J].POSL].DER[0] == '*') {
        printf("Распознан нетерминал: %s J=%i\n", SINT[J].DER, J);
        if (!strcmp(SINT[J].DER, CEL[K - 1].CEL1)) {
            mdst(CEL[K - 1].CEL1, CEL[K - 1].CEL2, CEL[K - 1].CEL3, I, J);
            if (!strcmp(CEL[K - 1].CEL1, "PRO")) {
                return 0;
            }

            L5:
            if (TPR[numb(CEL[K - 1].CEL1, 3)][numb(CEL[K - 1].CEL1, 3)]) {
                J = VXOD[numb(CEL[K - 1].CEL1, 3)].VX;
                goto L3;
            }

            L6:
            J = CEL[K - 1].CEL3;
            K--;
            goto L3;
        }

        if (!TPR[numb(SINT[J].DER, 3)][numb(CEL[K - 1].CEL1, 3)])
            goto L9;

        mdst(SINT[J].DER, CEL[K - 1].CEL2, 0, I, J);
        J = VXOD[numb(SINT[J].DER, 3)].VX;
        goto L3;
    }

    if (!TPR[numb(&STROKA[I], 1)][numb(SINT[J].DER, 3)])
        goto L8;

    mcel(SINT[J].DER, I, J);
    goto L2;

    // rollback
    L8:
    I--;
    printf("Возврат CEL= %s. J=%i, CHAR=%c,\n", CEL[K - 1].CEL1, J, STROKA[I]);

    L9:
    if (SINT[J].ALT != 0) {
        printf("Cмотрим ALT ветку для символа: %c %i\n", STROKA[I], SINT[J].ALT);
        J = SINT[J].ALT;
        goto L31;
    }

    J = SINT[J].PRED;

    if ((VXOD[numb(SINT[J].DER, 3)].TYP == 'N') && (SINT[J].PRED > 0)) {
        mcel(DST[L - 1].DST1, DST[L - 1].DST2, DST[L - 1].DST3);

        L10:
        J = DST[L - 1].DST5;
        L--;
        goto L9;
    }

    if ((VXOD[numb(SINT[J].DER, 3)].TYP == 'N') && (SINT[J].PRED == 0)) {
        if (!strcmp(CEL[K - 1].CEL1, DST[L - 1].DST1))
            goto L6;
        else
            goto L10;
    }

    if (SINT[J].PRED > 0) {
        goto L8;
    }

    J = CEL[K - 1].CEL3;
    K--;

    if (J == 999) {
        printf("FAIL AT I=%d J=%d DER='%s' CHAR='%c'\n", I, J, SINT[J].DER, STROKA[I]);
        return 2;
    } else {
        goto L8;
    }
}

/*..........................................................................*/

struct                                            /* таблица имен меток и   */
{                                                /* переменных, заполняемая*/
    char NAME[8];                                  /* на первом проходе се-  */
    char TYPE;                                      /* мантического вычисления*/
    char RAZR[5];                                  /* и используемая на вто- */
    char INIT[50];                                 /* ром проходе семантичес-*/
} SYM[NSYM];                                  /* кого вычисления        */

int ISYM = 0;                                     /* текущий индекс таблицы */
/* имен                   */

char NFIL[30] = "\x0";                             /* хранилище имени транс- */
/* лируемой программы     */

/*..........................................................................*/

long int VALUE(char *s)                        /* п р о г р а м м а      */
{                                                /* перевода двоичной      */
    long int S;                                     /* константы из ASCIIz-ви-*/
    int i;                                          /* да во внутреннее пред- */
    /* ставление типа long int*/
    i = 0;
    S = 0;
    while (*(s + i) != 'B') {

        S <<= 1;
        if (*(s + i) == '1')
            S++;
        i++;
    }

    return (S);
}


/*..........................................................................*/
void FORM()                                      /* п р о г р а м м а      */
{                                                /* представления фрагмента*/
    /* плотного текста в виде */
    /* массива 9-ти символьных*/
    /* лексем                 */
    int i, j;

    for (IFORMT = 0; IFORMT < MAXFORMT; IFORMT++)
        memcpy(FORMT[IFORMT], "\x0\x0\x0\x0\x0\x0\x0\x0\x0", 9);

    IFORMT = 0;
    j = DST[I2].DST2;

    FORM1:

    for (i = j; i <= DST[I2].DST4 + 1; i++) {
        if (STROKA[i] == ':' || STROKA[i] == ' ' ||
            STROKA[i] == '(' || STROKA[i] == ')' ||
            STROKA[i] == ';' || STROKA[i] == '+' ||
            STROKA[i] == '-' || STROKA[i] == '=' ||
            STROKA[i] == '*'
                ) {
            FORMT[IFORMT][i - j] = '\x0';
            IFORMT++;
            j = i + 1;
            goto FORM1;
        } else
            FORMT[IFORMT][i - j] = STROKA[i];

    }

    return;
}

/*..........................................................................*/
/* п р о г р а м м а      */
void ZKARD()                                     /* записи очередной сгене-*/
{                                                /* рированной записи вы-  */
    /* ходного файла в массив */
    /* ASSTXT                 */
    char i;
    memcpy(ASSTXT[IASSTXT++],
           ASS_CARD.BUFCARD, 80);

    for (i = 0; i < 79; i++)
        ASS_CARD.BUFCARD[i] = ' ';
    return;
}

/*..........................................................................*/
/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала AVI на пер-*/
/* вом проходе.   Здесь   */
/* AVI -   "арифм.выраж." */
int AVI1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала BUK на пер-*/
/* вом проходе.   Здесь   */
/* BUK -   "буква"        */
int BUK1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала CIF на пер-*/
/* вом проходе.   Здесь   */
/* CIF -   "цифра"        */
int CIF1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала IDE на пер-*/
/* вом проходе.   Здесь   */
/* IDE -   "идентификатор"*/
int IDE1() {
    return 0;
}

int IPE1() {
    return 0;
}

int IPR1() {
    return 0;
}

int LIT1() {
    return 0;
}

int MAN1() {
    return 0;
}

int ODC1() {
    int i;
    FORM();

    for (i = 0; i < ISYM; i++) {
        if (!strcmp(SYM[i].NAME, FORMT[1]) &&
            strlen(SYM[i].NAME) ==
            strlen(FORMT[1])
                )
            return 6;
    }

    strcpy(SYM[ISYM].NAME, FORMT[1]);
    strcpy(SYM[ISYM].RAZR, FORMT[4]);

    if (!strcmp(FORMT[2], "BIN") &&            /* если идентификатор оп- */
        !strcmp(FORMT[3], "FIXED"))/* ределен как bin fixed, */
    {
        SYM[ISYM].TYPE = 'B';                        /* то устанавливаем тип   */
        /* идентификатора = 'B' и */
        goto ODC11;                                   /* идем на продолжение об-*/
        /* работки, а             */
    } else                                            /* иначе                  */
    {
        SYM[ISYM].TYPE = 'U';                        /* устанавливаем тип иден-*/
        /* тификатора = 'U'  и    */
        return 2;                                     /* завершаем программу    */
        /* по ошибке              */
    }

    ODC11:                                            /* если идентификатор     */
    /* имеет начальную иници- */
    if (!strcmp(FORMT[5], "INIT"))           /* ализацию, то запомина- */
        strcpy(SYM[ISYM++].INIT, FORMT[6]);       /* ем в табл. SYM это на- */
        /* чальное значение, а    */
    else                                            /* иначе                  */
        strcpy(SYM[ISYM++].INIT, "0B");            /* инициализируем иденти- */
    /* фикатор нулем          */

    return 0;                                      /* успешное завешение     */
    /* программы              */
}

int OEN1() {
    char i = 0;
    FORM();

    for (i = 0; i < ISYM; i++) {
        if (!strcmp(SYM[i].NAME, FORMT[1]) &&
            (SYM[i].TYPE == 'P') &&
            strlen(SYM[i].NAME) ==
            strlen(FORMT[1]))
            return 0;
    }

    return 1;
}

int OPA1() {
    return 0;
}

int OPR1() {
    FORM();                                        /* форматируем оператор   */

    strcpy(SYM[ISYM].NAME, FORMT[0]);          /* перепишем имя ПЛ1-прог-*/

    SYM[ISYM].TYPE = 'P';                        /* установим тип этого    */
    /* имени = 'P'            */
    SYM[ISYM++].RAZR[0] = '\x0';                  /* установим разрядность  */
    /* равной 0               */

    return 0;                                       /* успешное завершение    */
    /* программы              */
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала PRO на пер-*/
/* вом проходе.   Здесь   */
/* PRO - "программа"      */

int PRO1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала RZR на пер-*/
/* вом проходе.   Здесь   */
/* RZR - "разрядность"    */

int RZR1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала TEL на пер-*/
/* вом проходе.   Здесь   */
/* TEL - "тело программы" */

// TODO
int TEL1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала ZNK на пер-*/
/* вом проходе.   Здесь   */
/* ZNK - "знак операции"  */

int ZNK1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала AVI на вто-*/
/* ром проходе.   Здесь   */
/* AVI -   "арифм.выраж." */


int AVI2() {
    char i;
    FORM();                                        /*форматируем правую часть*/
    /*арифметического ПЛ1-опе-*/
    /*ратора присваивания     */

    if (IFORMT == 1)                              /* если правая часть одно-*/
    {                                            /* термовая, то:          */
        for (i = 0; i < ISYM; i++)                  /* ищем этот терм в табли-*/
        {                                            /* це имен  и             */
            if (!strcmp(SYM[i].NAME, FORMT[0]) &&/* если находим, то:      */
                strlen(SYM[i].NAME) ==
                strlen(FORMT[0])
                    ) {
                if (SYM[i].TYPE == 'B')              /* в случае типа=bin fixed*/
                {

                    if (strcmp(SYM[i].RAZR, "15")    /* и разрядности <= 15    */
                        <= 0)
                        memcpy(ASS_CARD._BUFCARD.OPERAC,   /* формируем код ассембле-*/
                               "LH", 2);/* ровской операции LH,   */
                    else
                        memcpy(ASS_CARD._BUFCARD.OPERAC,   /* а при разрядности >15  */
                               "L", 1);/* формируем код ассембле-*/
                    /* ровской операции L     */

                    strcpy(ASS_CARD._BUFCARD.OPERAND,   /*       формируем        */
                           "RRAB,");/*       первый  и        */
                    strcat(ASS_CARD._BUFCARD.OPERAND,   /* второй операнды ассемб-*/
                           FORMT[0]);/* леровской операции     */

                    ASS_CARD._BUFCARD.OPERAND[strlen    /* вставляем разделитель  */
                            (ASS_CARD._BUFCARD.OPERAND)] = ' ';

                    memcpy(ASS_CARD._BUFCARD.COMM,      /* и построчный коментарий*/
                           "Загрузка переменной в регистр", 29);

                    ZKARD();                             /* запомнить операцию ас- */
                    /* семблера  и            */
                    return 0;                             /* завершить программу    */
                } else
                    return 3;                              /* если тип терма не bin  */
                /* fixed,то выход по ошиб-*/
                /* ке                     */
            }
        }
        return 4;                                     /* если терм-идентификатор*/
        /* неопределен, то выход  */
        /* по ошибке              */
    } else                                            /* если правая часть ариф-*/
        /* метического выражения  */
        /* двухтермовая, то:      */
    {
        for (i = 0; i < ISYM; i++)                  /* если правый терм ариф- */
        {                                            /* метического выражения  */
            if (!strcmp(SYM[i].NAME,                /*определен в табл.SYM,то:*/
                        FORMT[IFORMT - 1]) &&
                strlen(SYM[i].NAME) ==
                strlen(FORMT[IFORMT - 1])
                    ) {
                if (SYM[i].TYPE == 'B')              /* если тип правого опе-  */
                {                                      /* ранда bin fixed, то:   */

                    if (STROKA[DST[I2].DST4 -         /* если знак опер."+",то: */
                               strlen(FORMT[IFORMT - 1])] == '+') {
                        if (strcmp(SYM[i].RAZR, "15")  /* если разрядность прав. */
                            <= 0)/* операнда <= 15, то:    */
                            memcpy(ASS_CARD._BUFCARD.OPERAC,
                                   "AH", 2);/* формируем код ассембле-*/
                        else                                /* ровской операции "AH",а*/
                            memcpy(ASS_CARD._BUFCARD.OPERAC,
                                   "A", 1);/* иначе - "A"            */
                    } else {
                        if (STROKA[DST[I2].DST4 -       /* если же знак операции  */
                                   strlen(FORMT[IFORMT - 1])] == /* арифметического выра-  */
                            '-')/* жения "-", то:         */

                        {
                            if (strcmp(SYM[i].RAZR, "15")/* при разрядности ариф-  */
                                <= 0)/* метич.выраж.<= 15      */
                                memcpy(ASS_CARD._BUFCARD.OPERAC,/* формируем код ассембле-*/
                                       "SH", 2);/* ровской операции "SH",F*/
                            else
                                memcpy(ASS_CARD._BUFCARD.OPERAC,/* иначе - "S"            */
                                       "S", 1);
                        } else

                            return 5;                          /* если знак операции не  */
                        /* "+" и не "-", то завер-*/
                        /* шение  программы  по   */
                        /* ошибке                 */
                    }
                    /* формируем:             */
                    strcpy(ASS_CARD._BUFCARD.OPERAND,   /* - первый операнд ассем-*/
                           "RRAB,");/*блеровской операции;    */
                    strcat(ASS_CARD._BUFCARD.OPERAND,   /* - второй операнд ассем-*/
                           FORMT[IFORMT - 1]);/*блеровской операции;    */
                    ASS_CARD._BUFCARD.OPERAND[strlen
                            (ASS_CARD._BUFCARD.OPERAND)] =/* - разделяющий пробел;  */
                            ' ';
                    memcpy(ASS_CARD._BUFCARD.COMM,
                           "Формирование промежуточного значения",/* - построчный коментарий*/
                           36);
                    ZKARD();                             /* запоминание ассембле-  */
                    /* ровской операции       */

                    return 0;                             /* успешное завершение    */
                    /* пограммы               */
                } else
                    return 3;                              /* если тип правого опе-  */
                /* ранда арифметического  */
                /* выражения не bin fixed,*/
                /* то завершение програм- */
                /* мы по ошибке           */
            }
        }
        return 4;                                     /* если правый операнд    */
        /* арифметического выраже-*/
        /*ния не определен в табл.*/
        /* SYM, то завершить про- */
        /* грамму по ошибке       */
    }

}


int BUK2() {
    return 0;
}

int CIF2() {
    return 0;
}

int IDE2() {
    return 0;
}

int IPE2() {
    return 0;
}

int IPR2() {
    return 0;
}

int LIT2() {
    return 0;
}

int MAN2() {
    return 0;
}

int ODC2() {
    return 0;
}

int OEN2() {
    char RAB[20];
    char i = 0;
    FORM();

    memcpy(ASS_CARD._BUFCARD.OPERAC, "BCR", 3);
    memcpy(ASS_CARD._BUFCARD.OPERAND, "15,14", 5);
    memcpy(ASS_CARD._BUFCARD.COMM, "Выход из программы", 18);
    ZKARD();

    for (i = 0; i < ISYM; i++) {
        if (isalpha(SYM[i].NAME[0])) {
            if (SYM[i].TYPE == 'B') {
                strcpy(ASS_CARD._BUFCARD.METKA, SYM[i].NAME);
                ASS_CARD._BUFCARD.METKA[strlen(ASS_CARD._BUFCARD.METKA)] = ' ';
                memcpy(ASS_CARD._BUFCARD.OPERAC, "DC", 2);
                if (strcmp(SYM[i].RAZR, "15") <= 0) {
                    strcpy(ASS_CARD._BUFCARD.OPERAND, "H\'");
                } else {
                    strcpy(ASS_CARD._BUFCARD.OPERAND, "F\'");
                }


//Dos command
//	strcat ( ASS_CARD._BUFCARD.OPERAND,       /* формируем цифровую     */
//		 ltoa ( VALUE (SYM [i].INIT),     /* часть операнда псевдо- */
//				 &RAB [0], 10) ); /* операции,              */
//let's do that in Unix!
                strcat(ASS_CARD._BUFCARD.OPERAND, gcvt(VALUE(SYM[i].INIT), 10, &RAB[0]));
                ASS_CARD._BUFCARD.OPERAND[strlen        /* замыкающий апостроф    */
                        (ASS_CARD._BUFCARD.OPERAND)] = '\'';  /*          и             */

                memcpy(ASS_CARD._BUFCARD.COMM,          /* поле построчного комен-*/
                       "Определение переменной", 22);  /* тария                  */

                ZKARD();                                 /* запомнить операцию     */
                /*    Ассемблера          */
            }
        }
    }
    /* далее идет блок декла- */
    /* ративных ассемблеровс- */
    /* ких EQU-операторов, оп-*/
    /* ределяющих базовый и   */
    /* рабочий регистры общего*/
    /* назначения             */

    memcpy(ASS_CARD._BUFCARD.METKA, "RBASE", 5); /* формирование EQU-псев- */
    memcpy(ASS_CARD._BUFCARD.OPERAC, "EQU", 3);   /* дооперации определения */
    memcpy(ASS_CARD._BUFCARD.OPERAND, "15", 2);  /* номера базового регист-*/
    /* ра общего назначения   */
    /*           и            */
    ZKARD();                                       /* запоминание ее         */

    memcpy(ASS_CARD._BUFCARD.METKA, "RRAB", 4);  /* формирование EQU-псев- */
    memcpy(ASS_CARD._BUFCARD.OPERAC, "EQU", 3);   /* дооперации определения */
    memcpy(ASS_CARD._BUFCARD.OPERAND, "5", 1);   /* номера базового регист-*/
    /* ра общего назначения   */
    /*            и           */
    ZKARD();                                       /* запоминание ее         */

    memcpy(ASS_CARD._BUFCARD.OPERAC, "END", 3);  /* формирование кода ас-  */
    /* семблеровской псевдо-  */
    /* операции END,          */
    i = 0;

    while (FORMT[1][i] != '\x0')                 /* ее операнда            */
        ASS_CARD._BUFCARD.OPERAND[i] = FORMT[1][i++];/*         и              */

    memcpy(ASS_CARD._BUFCARD.COMM,                /* построчного коментария */
           "Конец программы", 15);

    ZKARD();                                       /* запоминание псевдоопе- */
    /* рации                  */

    return 0;                                       /* завершение программы   */
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала OPA на вто-*/
/* ром проходе.   Здесь   */
/* OPA - "операт.присваи- */
/* вания арифметический   */

int OPA2() {
    int i;

    FORM();                                        /*форматируем ПЛ1-оператор*/
    /*присваивания арифметич. */

    for (i = 0; i < ISYM; i++) {                                              /* если идентификатор пра-*/
        /* вой части оператора оп-*/
        if (!strcmp(SYM[i].NAME, FORMT[0]) &&  /* ределен ранее через    */
            strlen(SYM[i].NAME) ==               /* оператор DCL, то:      */
            strlen(FORMT[0])
                ) {
            if (SYM[i].TYPE == 'B')              /* если этот идентификатор*/
            {                                      /* имеет тип bin fixed,то:*/

                if (strcmp(SYM[i].RAZR, "15")    /* если bin fixed (15),то:*/
                    <= 0)
                    memcpy(ASS_CARD._BUFCARD.OPERAC,   /* сформировать команду   */
                           "STH", 3);/* записи полуслова       */

                else                                  /* иначе:                 */
                    memcpy(ASS_CARD._BUFCARD.OPERAC,   /* команду записи слова   */
                           "ST", 2);

                strcpy(ASS_CARD._BUFCARD.OPERAND,   /*       доформировать    */
                       "RRAB,");/*          операнды      */

                strcat(ASS_CARD._BUFCARD.OPERAND,   /*           команды      */
                       FORMT[0]);

                ASS_CARD._BUFCARD.OPERAND[strlen    /*              и         */
                        (ASS_CARD._BUFCARD.OPERAND)] = ' ';

                memcpy(ASS_CARD._BUFCARD.COMM,      /* построчный коментарий  */
                       "Формирование значения арифм.выражения",
                       37);
                ZKARD();                             /* запомнить операцию     */
                /* Ассемблера  и          */
                return 0;                             /* завершить программу    */
            } else                                    /* если идентификатор не  */
                /* имеет тип bin fixed,то:*/
                return 3;                              /* завершение с диагности-*/
            /* кой ошибки             */
        }
    }
    return 4;                                       /* если идентификатор ра- */
    /* нее не определен через */
    /* ПЛ1-оператор DCL,то за-*/
    /* вершение с диагностикой*/
    /* ошибки                 */

}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала OPR на вто-*/
/* ром проходе.   Здесь   */
/* OPR - "операт.ПЛ1-PROC"*/

/* программа    формирует */
/* пролог ассемблеровского*/
/* эквивалента  исходной  */
/* ПЛ1-программы          */
int OPR2() {
    char i = 0;
    FORM();                                        /* форматируем оператор   */
    /* ПЛ1 - "начало процедур-*/
    /* ного блока"            */
    while (FORMT[0][i] != '\x0')
        ASS_CARD._BUFCARD.METKA[i++] = FORMT[0][i];  /* нулевой терм используем*/
    /* как метку в START-псев-*/
    /* дооперации Ассемблера  */

    memcpy(ASS_CARD._BUFCARD.OPERAC, "START", 5);/* достраиваем код и опе- */
    memcpy(ASS_CARD._BUFCARD.OPERAND, "0", 1);   /* ранды  в  START-псевдо-*/
    memcpy(ASS_CARD._BUFCARD.COMM,                /* операции Ассемблера    */
           "Начало программы", 16);
    ZKARD();                                       /* запоминаем карту Ассем-*/
    /* блера                  */

    memcpy(ASS_CARD._BUFCARD.OPERAC, "BALR", 4); /* формируем BALR-операцию*/
    memcpy(ASS_CARD._BUFCARD.OPERAND,             /* Ассемблера             */
           "RBASE,0", 7);
    memcpy(ASS_CARD._BUFCARD.COMM,
           "Загрузить регистр базы", 22);
    ZKARD();                                       /* и запоминаем ее        */

    memcpy(ASS_CARD._BUFCARD.OPERAC, "USING", 5);/* формируем USING-псевдо-*/
    memcpy(ASS_CARD._BUFCARD.OPERAND,             /* операцию Ассемблера    */
           "*,RBASE", 7);
    memcpy(ASS_CARD._BUFCARD.COMM,
           "Назначить регистр базой", 23);
    ZKARD();                                       /* и запоминаем ее        */

    return 0;                                       /* завершить подпрограмму */
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала PRO на вто-*/
/* ром проходе.   Здесь   */
/* PRO - "программа"      */

int PRO2()                                       /*прогр.формирует выходной*/
{                                                /*файл                    */

    FILE *fp;                                       /*набор                   */
    /*рабочих                 */
    /*переменных              */

    strcat(NFIL, "ass");                        /*сформировать имя выход- */
    /*ного файла              */

    if ((fp = fopen(NFIL, "wb")) == NULL)     /*при неудачн.открыт.ф-ла */
        return (7);                                    /* сообщение об ошибке    */

    else                                            /*иначе:                  */
        fwrite(ASSTXT, 80, IASSTXT, fp);            /* формируем тело об.файла*/
    fclose(fp);                                  /*закрываем об'ектный файл*/
    return (0);                                   /*завершить полдпрограмму */
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала RZR на вто-*/
/* ром проходе.   Здесь   */
/* RZR - "разрядность"    */

int RZR2() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала TEL на вто-*/
/* ром проходе.   Здесь   */
/* TEL - "тело программы" */

// TODO
int TEL2() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала ZNK на вто-*/
/* ром проходе.   Здесь   */
/* ZNK - "знак операции"  */

int ZNK2() {
    return 0;
}

int gen_COD() {
    int NOSH;

    int (*FUN[NNETRM][2])() = {
            {AVI1, AVI2},
            {BUK1, BUK2},
            {CIF1, CIF2},
            {IDE1, IDE2},
            {IPE1, IPE2},
            {IPR1, IPR2},
            {LIT1, LIT2},
            {MAN1, MAN2},
            {ODC1, ODC2},
            {OEN1, OEN2},
            {OPA1, OPA2},
            {OPR1, OPR2},
            {PRO1, PRO2},
            {RZR1, RZR2},
            {TEL1, TEL2},
            {ZNK1, ZNK2}
    };

    for (I2 = 0; I2 < L; I2++)
        if ((NOSH = FUN[numb(DST[I2].DST1, 3)][0]()) != 0) return (NOSH);
    for (I2 = 0; I2 < L; I2++)
        if ((NOSH = FUN[numb(DST[I2].DST1, 3)][1]()) != 0)return (NOSH);
    return 0;
}

int main(int argc, char **argv) {
    // сначала читаем файл
    FILE *fp;
    char *ptr = argv[1];
    strcpy(NFIL, ptr);
    if (argc != 2) {
        printf("%s\n", "Ошибка в командной строке");
        return 0;
    }
    if (strcmp(&NFIL[strlen(NFIL) - 3], "pli")) {
        printf("%s\n", "Неверный тип файла с исходным текстом");
        return 0;
    } else {
        if ((fp = fopen(NFIL, "rb")) == NULL) {
            printf("%s\n", "Не найден файл с исходным текстом");
            return 0;
        } else {
            for (NISXTXT = 0; NISXTXT <= MAXNISXTXT; NISXTXT++) {
                if (!fread(ISXTXT[NISXTXT], 80, 1, fp)) { // чтение файла в буффер ISXTXT
                    if (feof(fp)) { // если был достигнут конец
                        goto main1;
                    } else {
                        printf("%s\n", "Ошибка при чтении фaйла с исх.текстом");
                        return 0;
                    }
                }
            }
            printf("%s\n", "Переполнение буфера чтения исх.текста");
            return 0;
        }
    }

    // когда прочитали файл, то работаем с ним
    main1:
    fclose(fp); // закрываем файл
    NFIL[strlen(NFIL) - 3] = '\x0';
    memset(ASS_CARD.BUFCARD, ' ', 80);
    compress_ISXTXT(); // лексический анализ (убираем лишние пробелы)
    build_TPR(); // достроение матрицы достижимости преемников. Фактически обновляет существующую таблицу
    if ((sint_ANAL())) { // синтаксический анализ
        STROKA[I4 + 20] = '\x0';
        printf("%s%s%s%s\n", "ошибка синтаксиса в исх.тексте -> ", "\"...", &STROKA[I4], "...\"");
        printf("%s\n", "трансляция прервана");
        return 0;
    } else {
        switch (gen_COD()) {
            case 0:
                printf("%s\n", "трансляция завершена успешно");
                return 0;
            case 1:
                printf("%s\n", "несовпадение имени процедуры в прологе-эпилоге");
                break;
            case 2:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "недопустимый тип идентификатора: ", &FORMT[1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;
            case 3:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "недопустимый тип идентификатора: ", &FORMT[IFORMT - 1],
                       " в исх.тексте -> \"...", &STROKA[DST[I2].DST2], "...\"");
                break;
            case 4:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "неопределенный идентификатор: ", &FORMT[IFORMT - 1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;
            case 5:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%c\n%s%s%s\n", "недопустимая операция: ", STROKA[DST[I2].DST4 - strlen(FORMT[IFORMT - 1])],
                       " в исх.тексте -> \"...", &STROKA[DST[I2].DST2], "...\"");
                break;
            case 6:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "повторное объявление идентификатора: ", &FORMT[1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;
        }
    }
    printf("%s\n", "трансляция прервана");
    return 0;
}
