/*
***** Н А Ч А Л О   файла компилятора с языка высокого уровня
*/

/*
***** Б л о к  об'явлений макроопределений
*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
/* п р е д е л ь н ы е    */
/* размеры:               */
#define MAXNISXTXT 50                             /* - исходного текста;    */
#define NSINT     259                             /* - табл.синтакс.правил; */
#define NCEL       20                             /* - стека целей;         */
#define NDST      500                             /* - стека достижений;    */
#define NVXOD      59                             /* - табл.входов;         */
#define NSTROKA   200                             /* - строки плотн.текста; */
#define NNETRM     18                             /* - списка нетерминалов; */
#define MAXLTXT    50                             /* - выходного текста;    */
#define MAXFORMT   30                             /* - форматированного ин- */
/* терпретируемого  фраг- */
/* мента исх.текста;      */
#define NSYM      100                             /* - таблицы имен и меток */

/*
***** Б а з а  данных компилятора
*/

/*
***** Б л о к  об'явления массива с исходным текстом
*/

int NISXTXT;                                     /* длина массива          */
char ISXTXT[MAXNISXTXT][800];                     /* тело массива           */

/*
***** Б л о к  об'явления рабочих переменных
*/

int I1, I2, I3, I4;                                  /* счетчики циклов        */

char PREDSYM = ' ';                               /*последний обработанный  */
/*символ в уплотненном    */
/*исходном тексте         */

char STROKA[NSTROKA];                          /*место хранения уплотнен-*/
/*ного исходного текста   */

int I, J, K, L;                                      /*текущие индексы соответ-*/
/*ственно в:              */
/* - уплотненном тексте;  */
/* - табл.грамм.правил;   */
/* - стеке поставленных   */
/*целей;                  */
/* - стеке достигнутых    */
/*целей;                  */

union                                             /*шаблон для генерации    */
{                                                /*записи выходного файла  */
    char BUFCARD[80];                           /*на АССЕМБЛЕРЕ IBM 370   */
    struct {
        char METKA[8];
        char PROB1;
        char OPERAC[5];
        char PROB2;
        char OPERAND[12];
        char PROB3;
        char COMM[52];
    } _BUFCARD;
} ASS_CARD;

char ASSTXT[MAXLTXT][80];                      /*массив для хранения     */
/*выходного текста на     */
/*АССЕМБЛЕРЕ IBM 370      */

int IASSTXT;                                     /*индекс выходного массива*/

char FORMT[MAXFORMT][9];                        /*массив для форматирован-*/
/*ного  (в виде последова-*/
/*тельности 9-ти позицион-*/
/*ных строк-лексем) пред- */
/*ставления интерпретиру- */
/*емого фрагмента исходно-*/
/*го плотного текста      */

int IFORMT;                                      /*индекс форматированного */
/*массива                 */
/*
***** Б л о к  об'явления таблиц базы данных
*/

/*
***** Т а б л и ц а, используемая как магазин (стек) достижений
*/

struct {
    char DST1[4];
    int DST2;
    int DST3;
    int DST4;
    int DST5;
} DST[NDST];

/*
***** Т а б л и ц а, используемая как магазин (стек) целей
*/

struct {
    char CEL1[4];
    int CEL2;
    int CEL3;
} CEL[NCEL];

/*
***** Т а б л и ц а, синтаксических правил, записанных в форме распознавания,
***** сгруппированных в "кусты" и представленных в виде двухнапрвленного
***** списка с альтернативными разветвлениями
*/

struct {
    int POSL;
    int PRED;
    char DER[4];
    int ALT;
} SINT[NSINT] =
/*   __________ _________ _______ _______ ______
    |  NN      :    посл : пред  :  дер  : альт |
    |__________:_________:_______:_______:______|                          */
        {
                {-1,  -1,  "***", -1},
                /*                              вход с символа - 0      */
                {2,   0,   "0  ", 0},
                {3,   1,   "CIF", 7},
                {0,   2,   "*  ", 0},
                /*                              вход с символа - 1      */
                {5,   0,   "1  ", 0},
                {6,   4,   "CIF", 7},
                {0,   5,   "*  ", 0},

                {8,   4,   "MAN", 0},
                {0,   7,   "*  ", 0},
                /*                              вход с символа - 2      */
                {10,  0,   "2  ", 0},
                {11,  9,   "CIF", 7},
                {0,   10,  "*  ", 0},
                /*                              вход с символа - 3      */
                {13,  0,   "3  ", 0},
                {14,  12,  "CIF", 0},
                {0,   13,  "*  ", 0},
                /*                              вход с символа - 4      */
                {16,  0,   "4  ", 0},
                {17,  15,  "CIF", 0},
                {0,   16,  "*  ", 0},
                /*                             вход с символа - 5      */
                {19,  0,   "5  ", 0},
                {20,  18,  "CIF", 0},
                {0,   19,  "*  ", 0},
                /*                              вход с символа - 6      */
                {22,  0,   "6  ", 0},
                {23,  21,  "CIF", 0},
                {0,   22,  "*  ", 0},
                /*                              вход с символа - 7      */
                {25,  0,   "7  ", 0},
                {26,  24,  "CIF", 0},
                {0,   25,  "*  ", 0},
                /*                              вход с символа - 8      */
                {28,  0,   "8  ", 0},
                {29,  27,  "CIF", 0},
                {0,   28,  "*  ", 0},
                /*                              вход с символа - 9      */
                {31,  0,   "9  ", 0},
                {32,  30,  "CIF", 0},
                {0,   31,  "*  ", 0},
                /*                              вход с символа - A      */
                {34,  0,   "A  ", 0},
                {35,  33,  "BUK", 0},
                {0,   34,  "*  ", 0},
                /*                              вход с символа - B      */
                {37,  0,   "B  ", 0},
                {38,  36,  "BUK", 0},
                {0,   37,  "*  ", 0},
                /*                              вход с символа - C      */
                {40,  0,   "C  ", 0},
                {41,  39,  "BUK", 0},
                {0,   40,  "*  ", 0},
                /*                              вход с символа - D      */
                {43,  0,   "D  ", 0},
                {44,  42,  "BUK", 45},
                {0,   43,  "*  ", 0},

                {46,  42,  "C  ", 215}, // TODO из-за добавленого ALT теперь в example не читается D= бла бла
                {47,  45,  "L  ", 0},
                {48,  46,  "   ", 0},
                {49,  47,  "IDE", 0},
                {50,  48,  "   ", 0},
                {51,  49,  "B  ", 0}, // тут убрана альтернатива, так как нам не надо читать CHAR в нашем кейсе
                {52,  50,  "I  ", 0},
                {53,  51,  "N  ", 0},
                {54,  52,  "   ", 0},
                {55,  53,  "F  ", 0},
                {56,  54,  "I  ", 0},
                {57,  55,  "X  ", 0},
                {58,  56,  "E  ", 0},
                {59,  57,  "D  ", 0},
                {60,  58,  "(  ", 0},
                {61,  59,  "RZR", 0},
                {62,  60,  ")  ", 0},
                {63,  61,  ";  ", 65},
                {64,  62,  "ODC", 0},
                {65,  63,  "*  ", 0},

                {66,  61,  "I  ", 0},
                {67,  65,  "N  ", 0},
                {68,  66,  "I  ", 0},
                {69,  67,  "T  ", 0},
                {70,  68,  "(  ", 0},
                {71,  69,  "LIT", 0},
                {72,  70,  ")  ", 0},
                {73,  71,  ";  ", 0},
                {186, 72,  "ODC", 0},
                /*                              вход с символа - E      */
                {75,  0,   "E  ", 0},
                {76,  74,  "N  ", 82},
                {77,  75,  "D  ", 0},
                {78,  76,  "   ", 0},
                {79,  77,  "IPR", 0},
                {80,  78,  ";  ", 0},
                {81,  79,  "OEN", 0},
                {0,   80,  "*  ", 0},

                {83,  74,  "BUK", 0},
                {0,   82,  "*  ", 0},
                /*                              вход с символа - M      */
                {85,  0,   "M  ", 0},
                {86,  84,  "BUK", 0},
                {0,   85,  "*  ", 0},
                /*                              вход с символа - P      */
                {88,  0,   "P  ", 0},
                {89,  87,  "BUK", 0},
                {0,   88,  "*  ", 0},
                /*                             вход с символа - X      */
                {91,  0,   "X  ", 0},
                {92,  90,  "BUK", 0},
                {0,   91,  "*  ", 0},
                /*                              вход с символа - BUK    */
                {94,  0,   "BUK", 0},
                {95,  93,  "IDE", 0},
                {0,   94,  "*  ", 0},
                /*                              вход с символа - IDE    */
                {97,  0,   "IDE", 0},
                {98,  96,  "BUK", 100},
                {99,  97,  "IDE", 0},
                {0,   98,  "*  ", 0},

                {101, 96,  "CIF", 103},
                {102, 100, "IDE", 0},
                {0,   101, "*  ", 0},

                {104, 96,  "IPE", 105},
                {0,   103, "*  ", 0},

                {106, 96,  "IPR", 0},
                {0,   105, "*  ", 0},
                /*                              вход с символа - +      */
                {108, 0,   "+  ", 0},
                {109, 107, "ZNK", 0},
                {0,   108, "*  ", 0},
                /*                              вход с символа - -      */
                {111, 0,   "-  ", 0},
                {112, 110, "ZNK", 0},
                {0,   111, "*  ", 0},
                /*                              вход с символа - IPR    */
                {114, 0,   "IPR", 0},
                {115, 113, ":  ", 0},
                {116, 114, "P  ", 0},
                {117, 115, "R  ", 0},
                {118, 116, "O  ", 0},
                {119, 117, "C  ", 0},
                {120, 118, "   ", 0},
                {121, 119, "O  ", 0},
                {122, 120, "P  ", 0},
                {123, 121, "T  ", 0},
                {124, 122, "I  ", 0},
                {125, 123, "O  ", 0},
                {126, 124, "N  ", 0},
                {127, 125, "S  ", 0},
                {128, 126, "(  ", 0},
                {129, 127, "M  ", 0},
                {130, 128, "A  ", 0},
                {131, 129, "I  ", 0},
                {132, 130, "N  ", 0},
                {133, 131, ")  ", 0},
                {134, 132, ";  ", 0},
                {135, 133, "OPR", 0},
                {0,   134, "*  ", 0},
                /*                               вход с символа - CIF    */
                {137, 0,   "CIF", 0},
                {138, 136, "RZR", 0},
                {0,   0,   "*  ", 0},
                /*                              вход с символа - RZR    */
                {140, 0,   "RZR", 0},
                {141, 139, "CIF", 0},
                {142, 140, "RZR", 0},
                {0,   141, "*  ", 0},
                /*                              вход с символа - MAN    */
                {144, 0,   "MAN", 0},
                {145, 143, "B  ", 147},
                {146, 144, "LIT", 0},
                {0,   145, "*  ", 0},

                {148, 143, "0  ", 161}, // TODO ALT 241 0 не читается, только BIN
                {149, 147, "MAN", 0},
                {0,   148, "*  ", 0},

                {151, 143, "1  ", 0}, // TODO ALT 241
                {152, 150, "MAN", 0},
                {0,   151, "*  ", 0},
                /*                              вход с символа - IPE    */
                {154, 0,   "IPE", 0},
                {155, 153, "=  ", 159},
                {156, 154, "AVI", 0},
                {157, 155, ";  ", 0},
                {158, 156, "OPA", 0},
                {0,   157, "*  ", 0},

                {160, 153, "AVI", 0},
                {0,   159, "*  ", 0},
                /*                              вход с символа - LIT    */
                {162, 0,   "LIT", 0},
                {163, 161, "AVI", 0},
                {0,   162, "*  ", 0},
                /*                              вход с символа - AVI    */
                {165, 0,   "AVI", 0},
                {166, 164, "ZNK", 0},
                {167, 165, "LIT", 168},
                {197, 166, "AVI", 0},

                {169, 165, "IPE", 0},
                {170, 168, "AVI", 0},
                {0,   169, "*  ", 0},
                /*                              вход с символа - OPR    */
                {172, 0,   "OPR", 0},
                {173, 171, "TEL", 0},
                {174, 172, "OEN", 0},
                {175, 173, "PRO", 0},
                {0,   174, "*  ", 0},
                /*                              вход с символа - ODC    */
                {177, 0,   "ODC", 0},
                {178, 176, "TEL", 0},
                {0,   177, "*  ", 0},
                /*                              вход с символа - TEL    */
                {180, 0,   "TEL", 0},
                {181, 179, "ODC", 183},
                {182, 180, "TEL", 0},
                {0,   181, "*  ", 0},

                {184, 179, "OPA", 247},
                {185, 183, "TEL", 0},
                {0,   184, "*  ", 0},

                {0,   73,  "*  ", 0},


                {188, 49,  "C  ", 0},
                {189, 187, "H  ", 0},
                {190, 188, "A  ", 0},
                {191, 189, "R  ", 0},
                {192, 190, "(  ", 0},
                {193, 191, "RZR", 0},
                {194, 192, ")  ", 0},
                {195, 193, ";  ", 0},
                {196, 194, "ODC", 0},
                {0,   195, "*  ", 0},

                {0,   166, "*  ", 0},

                {199, 0,   "*  ", 0},
                {200, 198, "ZNK", 0},
                {0,   199, "*  ", 0},
                /*                              вход с символа - N      */
                {202, 0,   "N  ", 0},
                {203, 201, "BUK", 0},
                {0,   202, "*  ", 0},
                /*                              вход с символа - S      */
                {205, 0,   "S  ", 0},
                {206, 204, "BUK", 0},
                {0,   205, "*  ", 0},
                /*                              вход с символа - O      */
                {208, 0,   "O  ", 0},
                {209, 207, "BUK", 0},
                {0,   208, "*  ", 0},
                /*                             вход с символа - W      */
                {211, 0,   "W  ", 0},
                {212, 210, "BUK", 0},
                {0,   211, "*  ", 0},
                /*                              вход с символа - ODW      */
                {214, 0,   "ODW", 0}, // TODO удалить
                /* AVI TO AVI , WHILE ( BUK < LIT ) ; */
                {215, 213, "D  ", 0}, // TODO удалить
                {216, 42, "O  ", 0},
                {217, 215, "   ", 0},

                {218, 216, "IDE", 0},

                {219, 217, "=  ", 0},

                {220, 218, "CIF", 0}, // TODO AVI было до  этого
                {221, 219, "   ", 0},

                {222, 220, "T  ", 0},
                {223, 221, "O  ", 0},
                {224, 222, "   ", 0},

                {225, 223, "CIF", 0}, // TODO AVI было до  этого

                {226, 224, ",  ", 0},

                {227, 225, "W  ", 0},
                {228, 226, "H  ", 0},
                {229, 227, "I  ", 0},
                {230, 228, "L  ", 0},
                {231, 229, "E  ", 0},

                {232, 230, "(  ", 0},

                {233, 231, "BUK", 0},
                {234, 232, "<  ", 0},
                {235, 233, "LIT", 0},

                {236, 234, ")  ", 0},

                {237, 235, ";  ", 0},
                {238, 236, "OPA", 0},
                {239, 237, "E  ", 0},
                {240, 238, "N  ", 0},
                {241, 239, "D  ", 0},
                {242, 240, ";  ", 0},
                {243, 241, "ODW", 0},
                {0,   242, "*  ", 0},
                /*                              вход с символа - ODW    */
                {245, 0, "ODW", 0},
                {246, 244, "TEL", 0},
                {0,   245, "*  ", 0},
                /*                              ALT для - TEL    */
                {248, 179, "ODW", 0},
                {249, 247, "TEL", 0},
                {0,   248, "*  ", 0},



        };

/*
***** Т а б л и ц а  входов в "кусты" ( корней )грамматических правил,
***** содержащая тип ( терминальность или нетерминальность ) корневых
***** символов
*/

struct {
    char SYM[4];
    int VX;
    char TYP;
} VXOD[NVXOD] =
/*   __________ ___________ _____ ______
    |  NN      |    символ | вход| тип  |
    |__________|___________|_____|______|                                  */

        {
                {/*.   0     .*/   "AVI", 164, 'N'},
                {/*.   1     .*/   "BUK", 93,  'N'},
                {/*.   2     .*/   "CIF", 136, 'N'},
                {/*.   3     .*/   "IDE", 96,  'N'},
                {/*.   4     .*/   "IPE", 153, 'N'},
                {/*.   5     .*/   "IPR", 113, 'N'},
                {/*.   6     .*/   "LIT", 161, 'N'},
                {/*.   7     .*/   "MAN", 143, 'N'},
                {/*.   8     .*/   "ODC", 176, 'N'},
                {/*.  9     .*/    "OEN", 0,   'N'},
                {/*.  10     .*/   "OPA", 0,   'N'},
                {/*.  11     .*/   "OPR", 171, 'N'},
                {/*.  12     .*/   "PRO", 0,   'N'},
                {/*.  13     .*/   "RZR", 139, 'N'},
                {/*.  14     .*/   "TEL", 179, 'N'},
                {/*.  15     .*/   "ZNK", 0,   'N'},
                {/*.  16     .*/   "ODW", 244, 'N'},
                {/*.  19     .*/   "A  ", 33,  'T'},
                {/*.  20     .*/   "B  ", 36,  'T'},
                {/*.  21     .*/   "C  ", 39,  'T'},
                {/*.  22     .*/   "D  ", 42,  'T'},
                {/*.  23     .*/   "E  ", 74,  'T'},
                {/*.  24     .*/   "M  ", 84,  'T'},
                {/*.  25     .*/   "P  ", 87,  'T'},
                {/*.  26     .*/   "X  ", 90,  'T'},
                {/*.  27     .*/   "0  ", 1,   'T'},
                {/*.  28     .*/   "1  ", 4,   'T'},
                {/*.  29     .*/   "2  ", 9,   'T'},
                {/*.  30     .*/   "3  ", 12,  'T'},
                {/*.  31     .*/   "4  ", 15,  'T'},
                {/*.  32     .*/   "5  ", 18,  'T'},
                {/*.  33     .*/   "6  ", 21,  'T'},
                {/*.  34     .*/   "7  ", 24,  'T'},
                {/*.  35     .*/   "8  ", 27,  'T'},
                {/*.  36     .*/   "9  ", 30,  'T'},
                {/*.  37     .*/   "+  ", 107, 'T'},
                {/*.  38     .*/   "-  ", 110, 'T'},
                {/*.  39     .*/   ":  ", 0,   'T'},
                {/*.  40     .*/   "I  ", 0,   'T'},
                {/*.  41     .*/   "R  ", 0,   'T'},
                {/*.  42     .*/   "N  ", 201, 'T'},
                {/*.  43     .*/   "O  ", 207, 'T'},
                {/*.  44     .*/   "T  ", 0,   'T'},
                {/*.  45     .*/   "S  ", 204, 'T'},
                {/*.  46     .*/   "(  ", 0,   'T'},
                {/*.  47     .*/   ")  ", 0,   'T'},
                {/*.  48     .*/   "   ", 0,   'T'},
                {/*.  49     .*/   ";  ", 0,   'T'},
                {/*.  50     .*/   "L  ", 0,   'T'},
                {/*.  51     .*/   "F  ", 0,   'T'},
                {/*.  52     .*/   "=  ", 0,   'T'},
                {/*.  53     .*/   "H  ", 0,   'T'},
                {/*.  54     .*/   "*  ", 198, 'T'},
                {/*.  55     .*/   "W  ", 210, 'T'},
                {/*.  56     .*/   "<  ", 0,   'T'},
                {/*.  57     .*/   ",  ", 0,   'T'},
        };

/*
***** Т а б л и ц а  матрицы смежности - основа построения матрицы
***** преемников
*/

char TPR[NVXOD][NNETRM] =
        {
/*
   __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
  |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK:ODW|
  |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___ */
                {/*AVI*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*BUK*/ 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*CIF*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*IDE*/ 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1},
                {/*IPE*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
                {/*IPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {/*LIT*/ 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*MAN*/ 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*ODC*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0},
                {/*OEN*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*OPA*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*OPR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
                {/*PRO*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*RZR*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {/*TEL*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0},
                {/*ZNK*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*ODW*/ 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0},
/*   __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
  |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK:ODW|
  |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___ */
                {/*  A*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  B*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  C*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  D*/ 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,  1},
                {/*  E*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,  0},
                {/*  M*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  P*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  X*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  0*/ 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  1*/ 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  2*/ 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  3*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  4*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  5*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0,  0},
                {/*  6*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,  0},
                {/*  7*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
/*
   __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
  |       AVI:BUK:CIF:IDE;IPE:IPR:LIT:MAN:ODC:OEN:OPA:OPR:PRO:RZR:TEL:ZNK:ODW
  |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___ */
                {/*  8*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  9*/ 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  +*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,  0},
                {/*  -*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,  0},
                {/*  :*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  I*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  R*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  N*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  O*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  T*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  S*/ 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  (*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  )*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  ;*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*   */ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
                {/*  L*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,  0},
/*
   __________ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___ ___
  |       AVI:BUK:CIF:IDE:IPE:IPR:LIT:MAN:ODC:OEN;OPA:OPR:PR0:RZR:TEL:ZNK:ODW
  |__________:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___:___ */
                {/*  F*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  =*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  H*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  **/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0},
                {/*  W*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  <*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {/*  ,*/ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
/*|_______________________________________________________________________| */
        };


void compress_ISXTXT() {
    I3 = 0;
    for (I1 = 0; I1 <= NISXTXT; I1++) {
        for (I2 = 0; I2 < 80; I2++) {
            if (ISXTXT[I1][I2] != '\x0') {
                if (ISXTXT[I1][I2] == ' ' &&
                    (PREDSYM == ' ' || PREDSYM == ';' ||
                     PREDSYM == ')' || PREDSYM == ':' ||
                     PREDSYM == '(') || PREDSYM == ',' ||
                    PREDSYM == '<') {
                    PREDSYM = ISXTXT[I1][I2];
                    goto L2;
                }

                if ((ISXTXT[I1][I2] == '+' ||
                     ISXTXT[I1][I2] == '-' ||
                     ISXTXT[I1][I2] == '=' ||
                     ISXTXT[I1][I2] == '(' ||
                     ISXTXT[I1][I2] == ')' ||
                     ISXTXT[I1][I2] == '*' ||
                     ISXTXT[I1][I2] == '<') &&
                    PREDSYM == ' ') {
                    if (I3 > 0 && STROKA[I3 - 1] == ' ')
                        I3--;
                    goto L1;
                }

                if (ISXTXT[I1][I2] == ' ' &&
                    (PREDSYM == '+' || PREDSYM == '-' ||
                     PREDSYM == '=' || PREDSYM == '*')) {
                    goto L2;
                }

                L1:
                PREDSYM = ISXTXT[I1][I2];
                STROKA[I3] = PREDSYM;
                I3++;

                L2:
                continue;
            } else {
                printf("BREAKED: %c . I1: %i, I2: %i\n", ISXTXT[I1][I2], I1, I2);
                break;
            }
        }
    }
    STROKA[I3] = '\x0';
}

/*..........................................................................*/

void build_TPR() {
    for (I1 = 0; I1 < NNETRM; I1++) {
        for (I2 = 0; I2 < NVXOD; I2++) {
            if (TPR[I2][I1] & (I1 != I2)) {
                for (I3 = 0; I3 < NNETRM; I3++)
                    TPR[I2][I3] |= TPR[I1][I3];
            }
        }
    }
}

/*..........................................................................*/

void mcel(char *T1, int T2, int T3)            /* программа заполнения   */
{                                                /* ячейки стека поставлен-*/
    /* ных целей              */
    strcpy (CEL[K].CEL1, T1);
    CEL[K].CEL2 = T2;
    CEL[K].CEL3 = T3;
    K++;
}

/*..........................................................................*/

void mdst(char *T1, int T2, int T3, int T4,
          int T5) {                                                /* программа заполнения   */
    strcpy (DST[L].DST1, T1);                  /* ячейки стека достигну- */
    DST[L].DST2 = T2;                            /* тых целей              */
    DST[L].DST3 = T3;
    DST[L].DST4 = T4;
    DST[L].DST5 = T5;
    L++;
}


/*..........................................................................*/
/* п р о г р а м м а      */
int numb(char *T1, int T2)                     /* вычисления порядкового */
/* номера строки в табл.  */
/* VXOD, соответствующей  */
/* строке-параметру функц.*/
{
    int k;

    for (I1 = 0; I1 < NVXOD; I1++) {
        for (k = 0; k < T2; k++) {
            if ((*(T1 + k) != VXOD[I1].SYM[k]))
                goto numb1;
        }
        if ((VXOD[I1].SYM[k] == '\x0') ||
            (VXOD[I1].SYM[k] == ' ')
                )
            return (I1);
        numb1:
        continue;
    }
    return -1;
}

int sint_ANAL() {

    I4 = 0;

    L1:

    K = 0;
    L = 0;
    I = 0;
    J = 1;
    mcel("PRO", I, 999);

    if (!TPR[numb(&STROKA[I], 1)][numb("PRO", 3)])
        return 1;

    L2:
    J = VXOD[numb(&STROKA[I], 1)].VX;
    printf("Прочитали VXOD. I=%d J=%d DER='%s' CHAR='%c'\n", I, J, SINT[J].DER, STROKA[I]);

    L3:
    J = SINT[J].POSL;
    if (J >= 0 && I >= 0) {
        printf("Прочитали следующее правило. I=%d J=%d SINT CHAR='%s' CHAR='%c'\n", I, J, SINT[J].DER, STROKA[I]);
        printf("Cтек: ");
        for (int i = 0; i < sizeof(CEL) / sizeof(CEL[0]); ++i) {
            printf(CEL[i].CEL1);
            printf(", ");
        }
        printf("\n");
    }

    L31:

    I++;

    if (I > I4)


        I4 = I;

    if (VXOD[numb(SINT[J].DER, 3)].TYP == 'T') {
        if (I >= 0 && J >= 0){
            printf("Прочитан терминал '%s'. Символ строки: '%c' \n", SINT[J].DER, STROKA[I]);
        }
        if (STROKA[I] == SINT[J].DER[0])
            goto L3;
        else
            goto L8;

    }

    L4:

    if (SINT[SINT[J].POSL].DER[0] == '*') {
        if (J > 0) {
            printf("Нетерминал %s прочитан до конца J=%i. \n", SINT[J].DER, J);
        }
        I--;

        printf("ПРОВЕРКА: %i , SINT: '%s', CEL:'%s'\n",strcmp(SINT[J].DER, CEL[K - 1].CEL1), SINT[J].DER, CEL[K-1].CEL1);
        if (!strcmp(SINT[J].DER, CEL[K - 1].CEL1)) {
            mdst(CEL[K - 1].CEL1, CEL[K - 1].CEL2, CEL[K - 1].CEL3, I, J);

            if (!strcmp(CEL[K - 1].CEL1, "PRO"))
                return 0;

            L5:

            printf("ПРОВЕРКА 2: K:'%i' ,CEL[K-1]:'%s'(i=%i). RESULT: %i \n",K,CEL[K - 1].CEL1, numb(CEL[K - 1].CEL1, 3), TPR[numb(CEL[K - 1].CEL1, 3)][numb(CEL[K - 1].CEL1, 3)]);
            if (TPR[numb(CEL[K - 1].CEL1, 3)][numb(CEL[K - 1].CEL1, 3)]) {
                J = VXOD[numb(CEL[K - 1].CEL1, 3)].VX;
                goto L3;
            }

            L6:

            J = CEL[K - 1].CEL3;
            K--;
            printf("'K' уменьшен: %i\n", K);
            goto L3;
        }

        printf("ПРОВЕРКА TPR НТ. J=%i, SINT: '%s'(i=%i), CEL:'%s'(j=%i). RESULT: %i,\n",J, SINT[J].DER,numb(SINT[J].DER, 3), CEL[K-1].CEL1,numb(CEL[K - 1].CEL1, 3),TPR[numb(SINT[J].DER, 3)][numb(CEL[K - 1].CEL1, 3)]);
        if (!TPR[numb(SINT[J].DER, 3)][numb(CEL[K - 1].CEL1, 3)]){
            goto L9;
        }

        mdst(SINT[J].DER, CEL[K - 1].CEL2, 0, I, J);
//        printf("читаем J из vxod. SINT: '%s'(J=%i, numb=%i). VXOD=%i\n", SINT[J].DER, J, numb(SINT[J].DER, 3),VXOD[numb(SINT[J].DER, 3)].VX);
        J = VXOD[numb(SINT[J].DER, 3)].VX;
        goto L3;
    }
    printf("ПРОВЕРКА TPR. J=%i, STROKA:'%s'(i=%i), SINT:'%s'(j=%i). SYMBOL: %c. RESULT: %i,\n", J, &STROKA[I],numb(&STROKA[I], 1),SINT[J].DER,numb(SINT[J].DER, 3),STROKA[I] ,TPR[numb(&STROKA[I], 1)][numb(SINT[J].DER, 3)]);
    char ODC_CHECK[3] = {'O','D','C'};
    int q = 0;
    char OPA_CHECK[3] = {'O','P','A'};
    printf("CHECK %i. DER: %s. C: %s\n\n",(strcmp(SINT[J].DER, OPA_CHECK)), SINT[J].DER, OPA_CHECK);
    if (!TPR[numb(&STROKA[I], 1)][numb(SINT[J].DER, 3)]
    || (STROKA[I] == 'D' && STROKA[I+1] == 'O' && (strcmp(SINT[J].DER, ODC_CHECK) == 0 || strcmp(SINT[J].DER, OPA_CHECK) == 0)))
        goto L8;
    printf("Заполняем ячейку. SINT: %s, I=%i, J=%i\n", SINT[J].DER, I, J);
    mcel(SINT[J].DER, I, J);
    goto L2;

    L8:

    I--;

    L9:
    if (J > 0 && I > 0) {
        printf("ПРОВЕРКА ALT SINT='%s'. J=%i. I='%i'. Символ I: '%c'\n", SINT[J].DER,J, I, STROKA[I]);
    }
    if (SINT[J].ALT != 0) {
        J = SINT[J].ALT;
        goto L31;
    }

    J = SINT[J].PRED;

    if((VXOD[numb(SINT[J].DER, 3)].TYP == 'N')&&(SINT[J].PRED > 0)) {
        mcel(DST[L - 1].DST1, DST[L - 1].DST2, DST[L - 1].DST3);

        L10:

        J = DST[L - 1].DST5;
        L--;
        goto L9;
    }

    if ((VXOD[numb(SINT[J].DER, 3)].TYP == 'N') && (SINT[J].PRED == 0)) {
        if (!strcmp(CEL[K - 1].CEL1, DST[L - 1].DST1))
            goto L6;
        else
            goto L10;
    }

    if (SINT[J].PRED > 0)
        goto L8;

    J = CEL[K - 1].CEL3;
    K--;

    if (J == 999) {
        printf("failed! J=%i,I=%i,SYMBOL=%c\n", J, I, STROKA[I]);
        return 2;
    } else {
        goto L8;
    }
}

/*..........................................................................*/

struct                                            /* таблица имен меток и   */
{                                                /* переменных, заполняемая*/
    char NAME[8];                                  /* на первом проходе се-  */
    char TYPE;                                      /* мантического вычисления*/
    char RAZR[5];                                  /* и используемая на вто- */
    char INIT[50];                                 /* ром проходе семантичес-*/
} SYM[NSYM];                                  /* кого вычисления        */

int ISYM = 0;                                     /* текущий индекс таблицы */
/* имен                   */

char NFIL[30] = "\x0";                             /* хранилище имени транс- */
/* лируемой программы     */

/*..........................................................................*/

long int VALUE(char *s)                        /* п р о г р а м м а      */
{                                                /* перевода двоичной      */
    long int S;                                     /* константы из ASCIIz-ви-*/
    int i;                                          /* да во внутреннее пред- */
    /* ставление типа long int*/
    i = 0;
    S = 0;
    while (*(s + i) != 'B') {

        S <<= 1;
        if (*(s + i) == '1')
            S++;
        i++;
    }

    return (S);
}


/*..........................................................................*/
void FORM()                                      /* п р о г р а м м а      */
{                                                /* представления фрагмента*/
    /* плотного текста в виде */
    /* массива 9-ти символьных*/
    /* лексем                 */
    int i, j;

    for (IFORMT = 0; IFORMT < MAXFORMT; IFORMT++)
        memcpy (FORMT[IFORMT], "\x0\x0\x0\x0\x0\x0\x0\x0\x0", 9);

    IFORMT = 0;
    j = DST[I2].DST2;

    FORM1:

    for (i = j; i <= DST[I2].DST4 + 1; i++) {
        if (STROKA[i] == ':' || STROKA[i] == ' ' ||
            STROKA[i] == '(' || STROKA[i] == ')' ||
            STROKA[i] == ';' || STROKA[i] == '+' ||
            STROKA[i] == '-' || STROKA[i] == '=' ||
            STROKA[i] == '*'
                ) {
            FORMT[IFORMT][i - j] = '\x0';
            IFORMT++;
            j = i + 1;
            goto FORM1;
        } else
            FORMT[IFORMT][i - j] = STROKA[i];

    }

    return;
}

/*..........................................................................*/
/* п р о г р а м м а      */
void ZKARD()                                     /* записи очередной сгене-*/
{                                                /* рированной записи вы-  */
    /* ходного файла в массив */
    /* ASSTXT                 */
    char i;
    memcpy (ASSTXT[IASSTXT++],
            ASS_CARD.BUFCARD, 800);

    for (i = 0; i < 79; i++)
        ASS_CARD.BUFCARD[i] = ' ';
    return;
}

/*..........................................................................*/
/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала AVI на пер-*/
/* вом проходе.   Здесь   */
/* AVI -   "арифм.выраж." */
int AVI1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала BUK на пер-*/
/* вом проходе.   Здесь   */
/* BUK -   "буква"        */
int BUK1() {
    return 0;
}

/*..........................................................................*/

/* п р о г р а м м а      */
/* семантич. вычисления   */
/* нетерминала CIF на пер-*/
/* вом проходе.   Здесь   */
/* CIF -   "цифра"        */
int CIF1() {
    return 0;
}

int IDE1() {
    return 0;
}


int IPE1() {
    return 0;
}


int IPR1() {
    return 0;
}

int LIT1() {
    return 0;
}

int MAN1() {
    return 0;
}

int ODC1() {
    int i;
    FORM();                                        /* форматирование ПЛ1-опе-*/
    /* ратора DCL             */

    for (i = 0; i < ISYM; i++)                    /* если фиксируем повтор- */
    {                                              /* повторное объявление   */
        if (!strcmp(SYM[i].NAME, FORMT[1]) &&  /* второго терма оператора*/
            strlen(SYM[i].NAME) ==              /* DCL, то                */
            strlen(FORMT[1])
                )
            return 6;                                    /* завершение программы   */
        /* по ошибке              */
    }

    strcpy (SYM[ISYM].NAME, FORMT[1]);          /* при отсутствии повтор- */
    strcpy (SYM[ISYM].RAZR, FORMT[4]);          /* ного объявления иденти-*/
    /* фикатора запоминаем его*/
    /* вместе с разрядностью в*/
    /* табл.SYM               */

    if (!strcmp(FORMT[2], "BIN") &&            /* если идентификатор оп- */
        !strcmp(FORMT[3], "FIXED"))/* ределен как bin fixed, */
    {
        SYM[ISYM].TYPE = 'B';                        /* то устанавливаем тип   */
        /* идентификатора = 'B' и */
        goto ODC11;                                   /* идем на продолжение об-*/
        /* работки, а             */
    } else                                            /* иначе                  */
    {
        SYM[ISYM].TYPE = 'U';                        /* устанавливаем тип иден-*/
        /* тификатора = 'U'  и    */
        return 2;                                     /* завершаем программу    */
        /* по ошибке              */
    }

    ODC11:                                            /* если идентификатор     */
    /* имеет начальную иници- */
    if (!strcmp(FORMT[5], "INIT"))           /* ализацию, то запомина- */
        strcpy (SYM[ISYM++].INIT, FORMT[6]);       /* ем в табл. SYM это на- */
        /* чальное значение, а    */
    else                                            /* иначе                  */
        strcpy (SYM[ISYM++].INIT, "0B");            /* инициализируем иденти- */
    /* фикатор нулем          */

    return 0;                                      /* успешное завешение     */
    /* программы              */
}

int OEN1() {
    char i = 0;
    FORM();                                        /* форматирование ПЛ1-опе-*/
    /* ратора END             */

    for (i = 0; i < ISYM; i++)                    /* если вторй терм опера- */
        /* тора END записан в табл*/
    {                                              /* SYM и его тип = "P",то:*/
        if (!strcmp(SYM[i].NAME, FORMT[1]) &&
            (SYM[i].TYPE == 'P') &&
            strlen(SYM[i].NAME) ==
            strlen(FORMT[1]))
            return 0;                                    /* успешное завершение    */

    }

    return 1;                                       /* иначе завершение прог- */
    /* раммы по ошибке        */
}

int OPA1() {
    return 0;
}

int OPR1() {
    FORM();                                        /* форматируем оператор   */
    /* ПЛ1 PROC               */

    strcpy (SYM[ISYM].NAME, FORMT[0]);          /* перепишем имя ПЛ1-прог-*/
    /* раммы в табл. SYM,     */

    SYM[ISYM].TYPE = 'P';                        /* установим тип этого    */
    /* имени = 'P'            */
    SYM[ISYM++].RAZR[0] = '\x0';                  /* установим разрядность  */
    /* равной 0               */

    return 0;                                       /* успешное завершение    */

}


int PRO1() {
    return 0;
}

int RZR1() {
    return 0;
}


int TEL1() {
    return 0;
}


int ZNK1() {
    return 0;
}


int AVI2() {
    char i;
    FORM();                                        /*форматируем правую часть*/


    if (IFORMT == 1)                              /* если правая часть одно-*/
    {                                            /* термовая, то:          */
        for (i = 0; i < ISYM; i++)                  /* ищем этот терм в табли-*/
        {                                            /* це имен  и             */
            if (!strcmp(SYM[i].NAME, FORMT[0]) &&/* если находим, то:      */
                strlen(SYM[i].NAME) ==
                strlen(FORMT[0])
                    ) {
                if (SYM[i].TYPE == 'B')              /* в случае типа=bin fixed*/
                {

                    if (strcmp(SYM[i].RAZR, "15")    /* и разрядности <= 15    */
                        <= 0)
                        memcpy (ASS_CARD._BUFCARD.OPERAC,   /* формируем код ассембле-*/
                                "LH", 2);/* ровской операции LH,   */
                    else
                        memcpy (ASS_CARD._BUFCARD.OPERAC,   /* а при разрядности >15  */
                                "L", 1);/* формируем код ассембле-*/
                    /* ровской операции L     */

                    strcpy (ASS_CARD._BUFCARD.OPERAND,   /*       формируем        */
                            "RRAB,");/*       первый  и        */
                    strcat (ASS_CARD._BUFCARD.OPERAND,   /* второй операнды ассемб-*/
                            FORMT[0]);/* леровской операции     */

                    ASS_CARD._BUFCARD.OPERAND[strlen    /* вставляем разделитель  */
                            (ASS_CARD._BUFCARD.OPERAND)] = ' ';

                    memcpy (ASS_CARD._BUFCARD.COMM,      /* и построчный коментарий*/
                            "Загрузка переменной в регистр", 29);

                    ZKARD();                             /* запомнить операцию ас- */
                    /* семблера  и            */
                    return 0;                             /* завершить программу    */
                } else
                    return 3;                              /* если тип терма не bin  */
                /* fixed,то выход по ошиб-*/
                /* ке                     */
            }
        }
        return 4;                                     /* если терм-идентификатор*/
    } else                                            /* если правая часть ариф-*/

    {
        for (i = 0; i < ISYM; i++)                  /* если правый терм ариф- */
        {                                            /* метического выражения  */
            if (!strcmp(SYM[i].NAME,                /*определен в табл.SYM,то:*/
                        FORMT[IFORMT - 1]) &&
                strlen(SYM[i].NAME) ==
                strlen(FORMT[IFORMT - 1])
                    ) {
                if (SYM[i].TYPE == 'B')              /* если тип правого опе-  */
                {                                      /* ранда bin fixed, то:   */

                    if (STROKA[DST[I2].DST4 -         /* если знак опер."+",то: */
                               strlen(FORMT[IFORMT - 1])] == '+') {
                        if (strcmp(SYM[i].RAZR, "15")  /* если разрядность прав. */
                            <= 0)/* операнда <= 15, то:    */
                            memcpy (ASS_CARD._BUFCARD.OPERAC,
                                    "AH", 2);/* формируем код ассембле-*/
                        else                                /* ровской операции "AH",а*/
                            memcpy (ASS_CARD._BUFCARD.OPERAC,
                                    "A", 1);/* иначе - "A"            */
                    } else {
                        if (STROKA[DST[I2].DST4 -       /* если же знак операции  */
                                   strlen(FORMT[IFORMT - 1])] == /* арифметического выра-  */
                            '-')/* жения "-", то:         */

                        {
                            if (strcmp(SYM[i].RAZR, "15")/* при разрядности ариф-  */
                                <= 0)/* метич.выраж.<= 15      */
                                memcpy(ASS_CARD._BUFCARD.OPERAC,/* формируем код ассембле-*/
                                       "SH", 2);/* ровской операции "SH",F*/
                            else
                                memcpy(ASS_CARD._BUFCARD.OPERAC,/* иначе - "S"            */
                                       "S", 1);
                        } else

                            return 5;                          /* если знак операции не  */

                    }
                    /* формируем:             */
                    strcpy (ASS_CARD._BUFCARD.OPERAND,   /* - первый операнд ассем-*/
                            "RRAB,");/*блеровской операции;    */
                    strcat (ASS_CARD._BUFCARD.OPERAND,   /* - второй операнд ассем-*/
                            FORMT[IFORMT - 1]);/*блеровской операции;    */
                    ASS_CARD._BUFCARD.OPERAND[strlen
                            (ASS_CARD._BUFCARD.OPERAND)] =/* - разделяющий пробел;  */
                            ' ';
                    memcpy (ASS_CARD._BUFCARD.COMM,
                            "Формирование промежуточного значения",/* - построчный коментарий*/
                            36);
                    ZKARD();                             /* запоминание ассембле-  */
                    /* ровской операции       */

                    return 0;                             /* успешное завершение    */
                    /* пограммы               */
                } else
                    return 3;                              /* если тип правого опе-  */
            }
        }
        return 4;                                     /* если правый операнд    */

    }

}

int BUK2() {
    return 0;
}

int CIF2() {
    return 0;
}

int IDE2() {
    return 0;
}

int IPE2() {
    return 0;
}

int IPR2() {
    return 0;
}

int LIT2() {
    return 0;
}


int MAN2() {
    return 0;
}


int ODC2() {
    return 0;
}


int OEN2() {
    char RAB[20];
    char i = 0;
    FORM();                                        /* форматируем ПЛ1-опера- */
    /* тор END                */

    memcpy (ASS_CARD._BUFCARD.OPERAC, "BCR", 3);  /* формируем код безуслов-*/
    /*ного возврата управления*/
    /* в вызывающую программу */

    memcpy (ASS_CARD._BUFCARD.OPERAND, "15,14", 5);/* операнды команды и     */

    memcpy (ASS_CARD._BUFCARD.COMM,                /* поле построчного комен-*/
            "Выход из программы", 18);/* тария                  */

    ZKARD();                                       /* запомнить опреацию     */

    for (i = 0; i < ISYM; i++) {                                              /* если строка табл.SYM   */
        if (isalpha(SYM[i].NAME[0]))           /* содержит идентификатор,*/
            /* т.е.начинается с буквы,*/
        {                                            /* то:                    */
            if (SYM[i].TYPE == 'B')                  /* если тип оператора bin */
                /* fixed, то:             */
            {
                strcpy (ASS_CARD._BUFCARD.METKA,         /* пишем идентификатор в  */
                        SYM[i].NAME); /* поле метки псевдоопера-*/
                /* ции DC                 */
                ASS_CARD._BUFCARD.METKA[strlen
                        (ASS_CARD._BUFCARD.METKA)] = ' '; /* пишем разделитель полей*/

                memcpy (ASS_CARD._BUFCARD.OPERAC,        /* пишем код псевдоопера- */
                        "DC", 2); /* ции DC                 */

                if (strcmp(SYM[i].RAZR, "15") <= 0) /* формируем операнды псе-*/
                    /* вдооперации DC         */
                    strcpy (ASS_CARD._BUFCARD.OPERAND,      /* для случая полуслова   */
                            "H\'");
                else                                      /* или                    */

                    strcpy (ASS_CARD._BUFCARD.OPERAND,      /* для случая слова       */                     "F\'");


                strcat(ASS_CARD._BUFCARD.OPERAND, gcvt(VALUE(SYM[i].INIT), 10, &RAB[0]));
                ASS_CARD._BUFCARD.OPERAND[strlen        /* замыкающий апостроф    */
                        (ASS_CARD._BUFCARD.OPERAND)] = '\'';  /*          и             */

                memcpy (ASS_CARD._BUFCARD.COMM,          /* поле построчного комен-*/
                        "Определение переменной", 22);  /* тария                  */

                ZKARD();                                 /* запомнить операцию     */
                /*    Ассемблера          */
            }
        }
    }


    memcpy (ASS_CARD._BUFCARD.METKA, "RBASE", 5); /* формирование EQU-псев- */
    memcpy (ASS_CARD._BUFCARD.OPERAC, "EQU", 3);   /* дооперации определения */
    memcpy (ASS_CARD._BUFCARD.OPERAND, "15", 2);  /* номера базового регист-*/
    /* ра общего назначения   */
    /*           и            */
    ZKARD();                                       /* запоминание ее         */

    memcpy (ASS_CARD._BUFCARD.METKA, "RRAB", 4);  /* формирование EQU-псев- */
    memcpy (ASS_CARD._BUFCARD.OPERAC, "EQU", 3);   /* дооперации определения */
    memcpy (ASS_CARD._BUFCARD.OPERAND, "5", 1);   /* номера базового регист-*/
    /* ра общего назначения   */
    /*            и           */
    ZKARD();                                       /* запоминание ее         */

    memcpy (ASS_CARD._BUFCARD.OPERAC, "END", 3);  /* формирование кода ас-  */
    /* семблеровской псевдо-  */
    /* операции END,          */
    i = 0;

    while (FORMT[1][i] != '\x0')                 /* ее операнда            */
        ASS_CARD._BUFCARD.OPERAND[i] = FORMT[1][i++];/*         и              */

    memcpy (ASS_CARD._BUFCARD.COMM,                /* построчного коментария */
            "Конец программы", 15);

    ZKARD();                                       /* запоминание псевдоопе- */
    /* рации                  */

    return 0;                                       /* завершение программы   */
}


int OPA2() {
    int i;

    FORM();                                        /*форматируем ПЛ1-оператор*/
    /*присваивания арифметич. */

    for (i = 0; i < ISYM; i++) {                                              /* если идентификатор пра-*/
        /* вой части оператора оп-*/
        if (!strcmp(SYM[i].NAME, FORMT[0]) &&  /* ределен ранее через    */
            strlen(SYM[i].NAME) ==               /* оператор DCL, то:      */
            strlen(FORMT[0])
                ) {
            if (SYM[i].TYPE == 'B')              /* если этот идентификатор*/
            {                                      /* имеет тип bin fixed,то:*/

                if (strcmp(SYM[i].RAZR, "15")    /* если bin fixed (15),то:*/
                    <= 0)
                    memcpy (ASS_CARD._BUFCARD.OPERAC,   /* сформировать команду   */
                            "STH", 3);/* записи полуслова       */

                else                                  /* иначе:                 */
                    memcpy (ASS_CARD._BUFCARD.OPERAC,   /* команду записи слова   */
                            "ST", 2);

                strcpy (ASS_CARD._BUFCARD.OPERAND,   /*       доформировать    */
                        "RRAB,");/*          операнды      */

                strcat (ASS_CARD._BUFCARD.OPERAND,   /*           команды      */
                        FORMT[0]);

                ASS_CARD._BUFCARD.OPERAND[strlen    /*              и         */
                        (ASS_CARD._BUFCARD.OPERAND)] = ' ';

                memcpy (ASS_CARD._BUFCARD.COMM,      /* построчный коментарий  */
                        "Формирование значения арифм.выражения",
                        37);
                ZKARD();                             /* запомнить операцию     */
                /* Ассемблера  и          */
                return 0;                             /* завершить программу    */
            } else                                    /* если идентификатор не  */
                /* имеет тип bin fixed,то:*/
                return 3;                              /* завершение с диагности-*/
            /* кой ошибки             */
        }
    }
    return 4;                                       /* если идентификатор ра- */

}


int OPR2() {
    char i = 0;
    FORM();


    while (FORMT[0][i] != '\x0')
        ASS_CARD._BUFCARD.METKA[i++] = FORMT[0][i];


    memcpy (ASS_CARD._BUFCARD.OPERAC, "START", 5);
    memcpy (ASS_CARD._BUFCARD.OPERAND, "0", 1);
    memcpy (ASS_CARD._BUFCARD.COMM,
            "Начало программы", 16);
    ZKARD();


    memcpy (ASS_CARD._BUFCARD.OPERAC, "BALR", 4);
    memcpy (ASS_CARD._BUFCARD.OPERAND,
            "RBASE,0", 7);
    memcpy (ASS_CARD._BUFCARD.COMM,
            "Загрузить регистр базы", 22);
    ZKARD();

    memcpy (ASS_CARD._BUFCARD.OPERAC, "USING", 5);
    memcpy (ASS_CARD._BUFCARD.OPERAND,
            "*,RBASE", 7);
    memcpy (ASS_CARD._BUFCARD.COMM,
            "Назначить регистр базой", 23);
    ZKARD();

    return 0;
}


int PRO2() {

    FILE *fp;


    strcat (NFIL, "ass");


    if ((fp = fopen(NFIL, "wb")) == NULL)
        return (7);

    else
        fwrite(ASSTXT, 80, IASSTXT, fp);
    fclose(fp);
    return (0);
}


int RZR2() {
    return 0;
}


int TEL2() {
    return 0;
}


int ZNK2() {
    return 0;
}


int gen_COD() {
    int NOSH;

    int (*FUN[NNETRM][2])() =
            {
                    {/*    1  */    AVI1, AVI2},
                    {/*    2  */    BUK1, BUK2},
                    {/*    3  */    CIF1, CIF2},
                    {/*    4  */    IDE1, IDE2},
                    {/*    5  */    IPE1, IPE2},
                    {/*    6  */    IPR1, IPR2},
                    {/*    7  */    LIT1, LIT2},
                    {/*    8  */    MAN1, MAN2},
                    {/*    9  */    ODC1, ODC2},
                    {/*   10  */    OEN1, OEN2},
                    {/*   11  */    OPA1, OPA2},
                    {/*   12  */    OPR1, OPR2},
                    {/*   13  */    PRO1, PRO2},
                    {/*   14  */    RZR1, RZR2},
                    {/*   15  */    TEL1, TEL2},
                    {/*   16  */    ZNK1, ZNK2}
            };

    for (I2 = 0; I2 < L; I2++)
        if ((NOSH = FUN[numb(DST[I2].DST1, 3)][0]()) != 0)
            return (NOSH);


    for (I2 = 0; I2 < L; I2++)
        if ((NOSH = FUN[numb(DST[I2].DST1, 3)][1]()) != 0)
            return (NOSH);
    return 0;

}


int main(int argc, char **argv) {
    FILE *fp;
    char *ptr = argv[1];
    strcpy (NFIL, ptr);

    if (argc != 2) {
        printf("%s\n", "Ошибка в командной строке");
        return 0;
    }

    if (strcmp(&NFIL[strlen(NFIL) - 3], "pli")) {
        printf("%s\n", "Неверный тип файла с исходным текстом");
        return 0;
    } else {
        if ((fp = fopen(NFIL, "rb")) == NULL) {
            printf("%s\n",
                   "Не найден файл с исходным текстом");
            return 0;
        } else {
            for (NISXTXT = 0; NISXTXT <= MAXNISXTXT; NISXTXT++) {
                if (!fread(ISXTXT[NISXTXT], 80, 1, fp)) {
                    if (feof(fp))
                        goto main1;
                    else {
                        printf("%s\n", "Ошибка при чтении фыйла с исх.текстом");
                        return 0;
                    }
                }
            }

            printf("%s\n", "Переполнение буфера чтения исх.текста");
            return 0;
        }

    }

    main1:
    fclose(fp);
    NFIL[strlen(NFIL) - 3] = '\x0';

    memset (ASS_CARD.BUFCARD, ' ', 80);


    compress_ISXTXT();
    build_TPR();
    printf(STROKA);
    printf("\n");
    if (sint_ANAL()) {
        STROKA[I4 + 20] = '\x0';
        printf("%s%s%s%s\n", "ошибка синтаксиса в исх.тексте -> ", "\"...", &STROKA[I4], "...\"");
        printf("%s\n", "трансляция прервана");
        return 0;
    } else {
        printf("Синт анализ успешно!");
        switch (gen_COD()) {
            case 0:
                printf("%s\n", "трансляция завершена успешно");
                return 0;
            case 1:
                printf("%s\n", "несовпадение имени процедуры в прологе-эпилоге");
                break;
            case 2:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "недопустимый тип идентификатора: ", &FORMT[1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;

            case 3:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "недопустимый тип идентификатора: ", &FORMT[IFORMT - 1],
                       " в исх.тексте -> \"...", &STROKA[DST[I2].DST2], "...\"");
                break;

            case 4:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "неопределенный идентификатор: ", &FORMT[IFORMT - 1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;

            case 5:

                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%c\n%s%s%s\n", "недопустимая операция: ", STROKA[DST[I2].DST4 - strlen(FORMT[IFORMT - 1])],
                       " в исх.тексте -> \"...", &STROKA[DST[I2].DST2], "...\"");
                break;
            case 6:
                STROKA[DST[I2].DST2 + 20] = '\x0';
                printf("%s%s\n%s%s%s\n", "повторное объявление идентификатора: ", &FORMT[1], " в исх.тексте -> \"...",
                       &STROKA[DST[I2].DST2], "...\"");
                break;
        }

    }

    printf("%s\n", "трансляция прервана");
    return 0;
}
/*..........................................................................*/
